{
  "version": "1.0",
  "last_updated": "2026-03-01",
  "worlds": [
    {
      "id": "known_world",
      "name": "The Known World",
      "description": "A vast, layered world of crumbling empires, wild frontiers, ancient forests, storm-wracked seas, and sorcerous cities. Magic is real but always exacts a price. The dead linger. Shadows have will. Gods are distant but not absent. Beneath the grim surface, wonder persists — in fae-touched glades, dragon-guarded peaks, bustling trade ports, and the stubborn courage of ordinary people.",
      "tone": "Sword & sorcery pulp — Howard, Smith, Leiber, with room for wonder, romance, humor, and hope alongside the darkness. Muscular prose, doomed heroes AND unlikely victors, ironic endings AND earned triumphs.",
      "rules": [
        "Magic always exacts a price — in blood, memory, years, or something less tangible.",
        "Shadow-magic is real; shadows can be stolen, sold, worn, or inhabited by other entities.",
        "Some treasure carries supernatural debt — curses that compound, pursue across generations, and cannot be escaped through conventional repayment. Most gold is just gold; the danger is never knowing which kind you hold.",
        "Demons deal in intangibles: years of life, happiness, certainty, loyalty.",
        "The dead can return to honor — or collect on — oaths sworn in life.",
        "Living architecture exists: structures that breathe, digest, or grow around the living.",
        "World-crossing is possible through rare magical catastrophe or demonic contract, but is never casual.",
        "The Fae Courts exist beyond mortal borders — capricious, beautiful, and bound by their own alien rules of hospitality and debt.",
        "Dragons are ancient, intelligent, and political — they hoard not just gold but secrets, oaths, and bloodlines.",
        "The sea has its own powers: merfolk nations, drowned gods, tide-magic, and currents that remember.",
        "Non-human peoples (dwarves, goblins, orcs, smallfolk, and others) have their own cultures, grudges, and ambitions — they are not merely monsters.",
        "Gods exist but rarely intervene directly; their priests and temples wield real but constrained divine power, and theological disputes can spark wars.",
        "Alchemy is a discipline distinct from sorcery — it transforms matter, brews poisons and cures, and can grant temporary abilities at physical cost.",
        "Prophecy is unreliable but influential — seers exist, their visions are fragmentary and often misinterpreted, and people wage wars over readings.",
        "Music, art, and spoken word can carry genuine magical weight — bardic magic, rune-carving, and name-magic are recognized traditions.",
        "Trade routes are the arteries of civilization — merchant guilds, caravan masters, and smuggler networks hold real political power.",
        "Nature is not passive: ancient forests resist axes, beast-spirits guard wild places, druids broker between civilization and the wild, and seasons can be weaponized by those who know the old ways.",
        "Fellowship matters: oaths of companionship, war-bands, thieves' guilds, and sworn crews carry real weight and real magic — betraying a fellowship-bond has consequences as severe as breaking any other oath."
      ],
      "world": "The Known World",
      "hemisphere": "unknown",
      "continent": "unknown",
      "subcontinent": "unknown",
      "realm": "unknown",
      "province": "unknown",
      "region": "unknown",
      "district": "unknown",
      "place": "",
      "parent_place": ""
    }
  ],
  "characters": [
    {
      "id": "vraxen_the_knife",
      "name": "Vraxen the Knife",
      "role": "Thief / Cursed Rogue",
      "world": "known_world",
      "status": "cursed",
      "bio": "A master thief who has robbed a hundred merchant princes. Attempted to rob the idol of Khar-Zul in its inner temple, prying six of nine emerald eyes free before the shadows came alive. Escaped with six gems but gained a new companion: a shadow wearing his own face, patient as carved stone, crouching beside him at dawn. His fate thereafter is unknown.",
      "traits": [
        "audacious",
        "calculating",
        "now-haunted"
      ],
      "known_locations": [
        "Temple of Khar-Zul"
      ],
      "affiliations": [],
      "first_story": "The Thief of Khar-Zul",
      "first_date": "2026-02-25",
      "appearances": 1,
      "notes": "His doppelganger shadow may reappear in future stories. The six emerald eyes of Khar-Zul are loose in the world.",
      "travel_scope": "unknown",
      "home_place": "",
      "home_region": "",
      "home_realm": "",
      "hemisphere": "unknown",
      "continent": "unknown",
      "subcontinent": "unknown",
      "realm": "unknown",
      "province": "unknown",
      "region": "unknown",
      "district": "unknown",
      "place": "",
      "parent_place": ""
    },
    {
      "id": "soraya",
      "name": "Soraya",
      "role": "Sell-Sword / Mercenary",
      "world": "known_world",
      "status": "active",
      "bio": "A renowned sell-sword hired to escort merchant caravans. Killed nine blood-cursed drivers on the Ashen Wastes when she discovered her employer Aldric had sold them to a sorcerer. Slew the sorcerer last, slowly. Kept none of Aldric's gold, but stole his shadow and sold it in the night markets of Pelimor. Tells herself it was justice.",
      "traits": [
        "ruthless efficiency",
        "dark conscience",
        "pragmatic morality"
      ],
      "known_locations": [
        "Ashen Wastes",
        "Pelimor"
      ],
      "affiliations": [],
      "first_story": "Blood-Price of the Caravan",
      "first_date": "2026-02-25",
      "appearances": 1,
      "notes": "Operates primarily around the Ashen Wastes and Pelimor. Has contacts in Pelimor's night markets.",
      "travel_scope": "unknown",
      "home_place": "",
      "home_region": "",
      "home_realm": "",
      "hemisphere": "unknown",
      "continent": "unknown",
      "subcontinent": "unknown",
      "realm": "unknown",
      "province": "unknown",
      "region": "unknown",
      "district": "unknown",
      "place": "",
      "parent_place": ""
    },
    {
      "id": "aldric",
      "name": "Aldric",
      "role": "Merchant / Schemer",
      "world": "known_world",
      "status": "shadow-stolen",
      "bio": "A spice merchant operating on the Ashen Wastes route. Hired Soraya as a sell-sword escort, while secretly paying bandits, toll-lords, and a blood-sorcerer to smooth his passage. His drivers were transformed into shadow-eyed killers. Survived the journey but had his shadow stolen by Soraya and sold in Pelimor's night markets.",
      "traits": [
        "duplicitous",
        "cowardly",
        "transactional"
      ],
      "known_locations": [
        "Ashen Wastes",
        "Pelimor"
      ],
      "affiliations": [],
      "first_story": "Blood-Price of the Caravan",
      "first_date": "2026-02-25",
      "appearances": 1,
      "notes": "A man without a shadow wandering the Known World. His fate may have interesting consequences.",
      "travel_scope": "unknown",
      "home_place": "",
      "home_region": "",
      "home_realm": "",
      "hemisphere": "unknown",
      "continent": "unknown",
      "subcontinent": "unknown",
      "realm": "unknown",
      "province": "unknown",
      "region": "unknown",
      "district": "unknown",
      "place": "",
      "parent_place": ""
    },
    {
      "id": "malachite_doss",
      "name": "Malachite Doss",
      "role": "Scholar / Ruin-Delver",
      "world": "known_world",
      "status": "changed",
      "bio": "A scholar of ancient ruins who descended into the Sunken Ziggurat of Yeng and found the Lamp of Suroth. Lit it in exchange for one truth and the destruction of one lie he had lived by. Learned his dead wife had never loved him — only his library — a truth he had suppressed for thirty years. The flame consumed his belief that knowledge was its own reward. Left the ruin lighter and heavier at once, no longer certain of his life's purpose.",
      "traits": [
        "intellectual",
        "self-deceiving",
        "changed by truth"
      ],
      "known_locations": [
        "Sunken Ziggurat of Yeng"
      ],
      "affiliations": [],
      "first_story": "The Lamp of Suroth",
      "first_date": "2026-02-25",
      "appearances": 1,
      "notes": "Carries the memory of the Lamp's truth. May return to ruins seeking further truths or running from them.",
      "travel_scope": "unknown",
      "home_place": "",
      "home_region": "",
      "home_realm": "",
      "hemisphere": "unknown",
      "continent": "unknown",
      "subcontinent": "unknown",
      "realm": "unknown",
      "province": "unknown",
      "region": "unknown",
      "district": "unknown",
      "place": "",
      "parent_place": ""
    },
    {
      "id": "kael_bloodhorn",
      "name": "Kael Bloodhorn",
      "role": "Warlord / Barbarian Chief",
      "world": "known_world",
      "status": "broken",
      "bio": "Chieftain who brought 800 Veth warriors to siege the Bone Citadel, a living fortress of bone-white stone. Lost 700 warriors to its defenses before reaching the heart chamber. Sent his last 100 through drainage tunnels with torches; they were absorbed into the Citadel's walls — alive, preserved, breathing, visible like insects in amber. Kael spent the rest of his life attempting to free them. He failed. He never stopped trying.",
      "traits": [
        "stubborn valor",
        "grief-driven",
        "relentless"
      ],
      "known_locations": [
        "Bone Citadel",
        "the Steppe"
      ],
      "affiliations": [
        "Veth warriors"
      ],
      "first_story": "Siege of the Bone Citadel",
      "first_date": "2026-02-25",
      "appearances": 1,
      "notes": "His warriors remain alive within the Bone Citadel walls. The Citadel screamed for three days after being burned, then went still — its status is unknown.",
      "travel_scope": "unknown",
      "home_place": "",
      "home_region": "",
      "home_realm": "",
      "hemisphere": "unknown",
      "continent": "unknown",
      "subcontinent": "unknown",
      "realm": "unknown",
      "province": "unknown",
      "region": "unknown",
      "district": "unknown",
      "place": "",
      "parent_place": ""
    },
    {
      "id": "tessaly_dorn",
      "name": "Tessaly Dorn",
      "role": "Adventurer / Debt-Collector",
      "world": "known_world",
      "status": "active — in service to the dead",
      "bio": "An adventurer who spent twelve gold coins from Yarithax's hoard before reading the inscription: 'This debt is not yet settled.' The Lich-King's grey collectors found her — two thin men who walk through walls and never sleep. After failing to pay with soul or years, she settled an eleven-month debt working as a collector herself, chasing debts for the dead. She collected punctually. She understood the job.",
      "traits": [
        "resourceful",
        "quick-thinking",
        "grimly professional"
      ],
      "known_locations": [
        "wherever debts lead"
      ],
      "affiliations": [
        "Yarithax's collectors (former)"
      ],
      "first_story": "The Curse of Yarithax's Gold",
      "first_date": "2026-02-25",
      "appearances": 1,
      "notes": "Her debt is paid. But she knows the collectors and their methods. Yarithax's gold still circulates in the world.",
      "travel_scope": "unknown",
      "home_place": "",
      "home_region": "",
      "home_realm": "",
      "hemisphere": "unknown",
      "continent": "unknown",
      "subcontinent": "unknown",
      "realm": "unknown",
      "province": "unknown",
      "region": "unknown",
      "district": "unknown",
      "place": "",
      "parent_place": ""
    },
    {
      "id": "pieter_vane",
      "name": "Pieter Vane",
      "role": "Oath-Breaker",
      "world": "known_world",
      "status": "presumed dead / claimed by the dead",
      "bio": "A man who broke his oath to a dead king on a Tuesday, for twenty gold pieces and a horse. The horse went lame; the gold was spent in a month. The dead king found him in a dockside tavern three provinces away the following Wednesday — patient, without threat. Pieter recited the oath from memory without being asked; he had never forgotten it. He paid his tab, followed the dead king into the cold street, and was never seen again. A new unmarked tomb appeared on the north road soon after.",
      "traits": [
        "guilty",
        "haunted",
        "ultimately honorable in his acceptance"
      ],
      "known_locations": [
        "dockside tavern (province unknown)",
        "north road tomb"
      ],
      "affiliations": [],
      "first_story": "The Oath-Breaker's Due",
      "first_date": "2026-02-25",
      "appearances": 1,
      "notes": "Almost certainly dead and entombed. The dead king's identity is unknown — a potential story hook.",
      "travel_scope": "unknown",
      "home_place": "",
      "home_region": "",
      "home_realm": "",
      "hemisphere": "unknown",
      "continent": "unknown",
      "subcontinent": "unknown",
      "realm": "unknown",
      "province": "unknown",
      "region": "unknown",
      "district": "unknown",
      "place": "",
      "parent_place": ""
    },
    {
      "id": "conjuress_mel",
      "name": "Conjuress Mel",
      "role": "Sorceress / Demonologist",
      "world": "known_world",
      "status": "active — partner to Varek",
      "bio": "A conjuress who owed three favors to the demon Varek for spells cast during the Siege of Amrath. The first favor: deliver a letter to a dead man — completed. The second: steal a year from a sleeping child — refused, punished, ultimately complied. The third, named on her wedding morning: her marriage itself — happiness as collection. Instead she drew a binding circle she had months to prepare and offered Varek an unprecedented counter: herself as a fellow collector of intangibles. Varek agreed. They work together now.",
      "traits": [
        "brilliant",
        "ruthless when cornered",
        "pragmatic survivor"
      ],
      "known_locations": [
        "Amrath (past)",
        "unknown (present)"
      ],
      "affiliations": [
        "Varek (partner)"
      ],
      "first_story": "The Sorcerer's Debt",
      "first_date": "2026-02-25",
      "appearances": 1,
      "notes": "Now partners with Varek. They collect intangibles — happiness, certainty, loyalty, love — from mortals. A significant ongoing force in the Known World.",
      "travel_scope": "unknown",
      "home_place": "",
      "home_region": "",
      "home_realm": "",
      "hemisphere": "unknown",
      "continent": "unknown",
      "subcontinent": "unknown",
      "realm": "unknown",
      "province": "unknown",
      "region": "unknown",
      "district": "unknown",
      "place": "",
      "parent_place": ""
    },
    {
      "id": "varek",
      "name": "Varek",
      "role": "Demon / Collector of Intangibles",
      "world": "known_world",
      "status": "active — partnered with Conjuress Mel",
      "bio": "An elegant demon who deals in intangibles: years of life, happiness, certainty, loyalty. Made a three-favor contract with Conjuress Mel during the Siege of Amrath. Planned to claim her marriage (happiness) as his third collection, but was outmaneuvered when she offered herself as a partner-collector instead. Accepted, as it was a better arrangement for both. Now collects alongside Mel.",
      "traits": [
        "elegant",
        "patient",
        "genuinely capable of surprise"
      ],
      "known_locations": [
        "everywhere and nowhere"
      ],
      "affiliations": [
        "Conjuress Mel (partner)"
      ],
      "first_story": "The Sorcerer's Debt",
      "first_date": "2026-02-25",
      "appearances": 3,
      "notes": "Can be encountered at weddings, moments of great happiness, or wherever certainty gathers. Is genuinely surprised by mortals who outthink him — rare and notable.\nPartnership with Kira adds a second active collector to Varek's operations. He remains impressed by mortals who outthink him—Kira's ritual qualifies as rare and notable.",
      "travel_scope": "interrealm",
      "home_place": "unknown",
      "home_region": "unknown",
      "home_realm": "unknown",
      "hemisphere": "unknown",
      "continent": "unknown",
      "subcontinent": "unknown",
      "realm": "unknown",
      "province": "unknown",
      "region": "unknown",
      "district": "unknown",
      "place": "",
      "parent_place": "",
      "status_history": [
        {
          "date": "2026-02-28",
          "from_status": "active — partnered with Conjuress Mel",
          "to_status": "active — partnered with Conjuress Mel",
          "type": "other",
          "story_title": "The Weight of Stolen Years",
          "note": "Varek initiates a partnership with Sorceress Kira after she successfully reverse-engineers and counters his demon-collection method.",
          "evidence": "Kira steals back years Varek collected and takes his certainty as fee; 'Varek watched from elsewhere, impressed by her ingenuity. A partnership began that morning.' This formalizes Kira as a co-collector alongside Mel."
        }
      ],
      "travel_notes": "[2026-02-28] Demonstrates ability to appear 'everywhere and nowhere' and manifest at moments of great happiness; canon already notes encounters at weddings and places of certainty; new story shows him observing events across locations (watching Kira from 'elsewhere'), confirming interrealm presence.",
      "aliases": [
        "Varek the demon"
      ],
      "tagline": "Patient. Elegant. Efficient."
    },
    {
      "id": "urgha_the_unmoved",
      "name": "Urgha the Unmoved",
      "role": "Mercenary / Warrior",
      "world": "known_world",
      "status": "active",
      "bio": "A mercenary of fearsome reputation, named for her emotional detachment. Hired by an emperor to retrieve a tax collector's funds or his ears. Instead showed mercy when she found the collector had spent the money on physicians for his ill daughter. She kept neither money nor ears, sent her own personal physician to treat the child, and paid out of pocket. She remained unmoved — and was very angry about having shown mercy for years afterward.",
      "traits": [
        "ferocious",
        "secretly compassionate",
        "proud of her reputation"
      ],
      "known_locations": [
        "various — mercenary routes"
      ],
      "affiliations": [
        "the emperor (client)",
        "her personal physician"
      ],
      "first_story": "The Barbarian's Mercy",
      "first_date": "2026-02-25",
      "appearances": 1,
      "notes": "The emperor presumably still wants his money or the collector's ears. Urgha's mercy may have consequences.",
      "travel_scope": "unknown",
      "home_place": "",
      "home_region": "",
      "home_realm": "",
      "hemisphere": "unknown",
      "continent": "unknown",
      "subcontinent": "unknown",
      "realm": "unknown",
      "province": "unknown",
      "region": "unknown",
      "district": "unknown",
      "place": "",
      "parent_place": ""
    },
    {
      "id": "cassia_vorn",
      "name": "Cassia Vorn",
      "role": "Thief / Avenger",
      "world": "known_world",
      "status": "active — and diminished",
      "bio": "The last thief of Crimson Gate, a city burned with three thousand people inside. Negotiated with a demon past all the standard offers (wealth, power, enemy's life) until the demon, unused to educated clients, dropped its script and simply asked what she wanted. She wanted the name of the man who burned Crimson Gate — information, not power, the currency of an older economy. She traded her certainty (intoxicating to beings made of doubt) for the name, then used it. She is notably less certain now, but the name was used.",
      "traits": [
        "razor intelligence",
        "grief-driven",
        "now uncertain"
      ],
      "known_locations": [
        "Crimson Gate (ruins)",
        "wherever vengeance leads"
      ],
      "affiliations": [],
      "first_story": "The Last Thief of Crimson Gate",
      "first_date": "2026-02-25",
      "appearances": 1,
      "notes": "The man who burned Crimson Gate has been identified. His fate is a story hook. Cassia's lost certainty may have ongoing consequences — what does a sharp mind look like without its sharpest edge?",
      "travel_scope": "unknown",
      "home_place": "",
      "home_region": "",
      "home_realm": "",
      "hemisphere": "unknown",
      "continent": "unknown",
      "subcontinent": "unknown",
      "realm": "unknown",
      "province": "unknown",
      "region": "unknown",
      "district": "unknown",
      "place": "",
      "parent_place": ""
    },
    {
      "id": "king_aldous_iii",
      "name": "King Aldous III",
      "role": "King (deceased)",
      "world": "known_world",
      "status": "deceased",
      "bio": "Won a desperate war by wearing the Plague-Bringer's Crown from the sealed vault beneath Ostern for thirty seconds. The gambit worked — the enemy surrendered rather than face a man with nothing left to lose. Reigned eleven more years: erratic, sleepless, prone to speaking to people who were not in the room. His shadow had been on backwards for years, which the physicians noted only after his death by ordinary causes. The Crown was returned to Ostern, which built a deeper vault.",
      "traits": [
        "reckless courage",
        "haunted",
        "effective despite madness"
      ],
      "known_locations": [
        "Ostern (kingdom)",
        "the royal court"
      ],
      "affiliations": [
        "the kingdom of Ostern"
      ],
      "first_story": "The Plague-Bringer's Crown",
      "first_date": "2026-02-25",
      "appearances": 1,
      "notes": "Dead of natural causes. His backwards shadow suggests the Crown's curse ran deeper than thirty seconds. The deeper vault at Ostern is a story hook.",
      "travel_scope": "unknown",
      "home_place": "",
      "home_region": "",
      "home_realm": "",
      "hemisphere": "unknown",
      "continent": "unknown",
      "subcontinent": "unknown",
      "realm": "unknown",
      "province": "unknown",
      "region": "unknown",
      "district": "unknown",
      "place": "",
      "parent_place": ""
    },
    {
      "id": "kael_the_nameless",
      "name": "Kael the Nameless",
      "tagline": "Shadow-broker. Identity-thief. Consumed.",
      "role": "Shadow-Broker",
      "world": "known_world",
      "status": "dead",
      "home_place": "Xul'thyris",
      "home_region": "unknown",
      "home_realm": "unknown",
      "travel_scope": "local",
      "bio": "A shadow-broker who dealt in stolen identities and borrowed faces in the gambling dens of Xul'thyris. Hired to sever the High Magistrate's shadow from light and stone, Kael discovered that shadows hunger and remember their owners. He was consumed by his own theft, becoming nothing but darkness wearing skin.",
      "traits": [
        "skilled at deception",
        "mercenary",
        "haunted by stolen lives"
      ],
      "known_locations": [
        "Xul'thyris"
      ],
      "affiliations": [
        "merchant prince"
      ],
      "notes": "His fate warns of the dangers of shadow-magic; shadows retain autonomy and appetite. The shadow-broker trade may be larger than a single practitioner.",
      "first_story": "The Shadow-Broker's Debt",
      "first_date": "2026-02-27",
      "appearances": 2,
      "aliases": [
        "Kael"
      ]
    },
    {
      "id": "mordica_bone_carver",
      "name": "Mordica the Bone-Carver",
      "tagline": "Sculptor of suffering. Forty years. Consumed.",
      "role": "Bone-Carver / Necromancer",
      "world": "known_world",
      "status": "dead",
      "home_place": "unknown",
      "home_region": "unknown",
      "home_realm": "unknown",
      "travel_scope": "local",
      "bio": "A bone-carver for forty years who carved phylacteries and spirit-binding totems without moral question. Hired by a widow to bind her daughter's remains with anguish, she created a monument in bone and suffering—only to become the final piece of the widow's terrible work.",
      "traits": [
        "amoral craftsperson",
        "skilled in necromancy",
        "price-blind"
      ],
      "known_locations": [
        "unknown"
      ],
      "affiliations": [
        "widow"
      ],
      "notes": "The widow's ritual consumed Mordica's flesh and youth; suggests bone-carving magic exacts physical toll on the practitioner. The 'Old Tongue' is confirmed as a source of binding power.",
      "first_story": "The Bone-Carver's Last Commission",
      "first_date": "2026-02-27",
      "appearances": 1
    },
    {
      "id": "yareth_steppe_rider",
      "name": "Yareth",
      "tagline": "Sister-seeker. Joy-bartered. Haunted.",
      "role": "Steppe-Rider / Warrior",
      "world": "known_world",
      "status": "alive",
      "home_place": "unknown",
      "home_region": "the blasted steppes",
      "home_realm": "unknown",
      "travel_scope": "regional",
      "bio": "A steppe-rider searching the blasted steppes for her brother, lost during a war for the Sunken Wells. She bargained with a being of impossible nature for his return—trading seven years of her joy. Her brother returned unchanged but amnesiac, and Yareth exists in a hollow shell, her emotions consumed by the bargain.",
      "traits": [
        "determined",
        "grief-stricken",
        "desperate"
      ],
      "known_locations": [
        "blasted steppes",
        "Old Keth"
      ],
      "affiliations": [
        "brother (echo-bound)"
      ],
      "notes": "The Underlords are confirmed entities with gardens deep below. Bargains with non-human beings carry unpredictable costs. Her brother may not be truly her brother anymore.",
      "first_story": "The Steppe-Rider's Bargain",
      "first_date": "2026-02-27",
      "appearances": 1
    },
    {
      "id": "caros_the_fortunate",
      "name": "Caros the Fortunate",
      "tagline": "Treasure-finder. Curse-bearer. Consumed.",
      "role": "Thief / Fugitive",
      "world": "known_world",
      "status": "dead",
      "home_place": "unknown",
      "home_region": "unknown",
      "home_realm": "unknown",
      "travel_scope": "local",
      "bio": "A fortunate thief who stumbled upon Morthaxes's cursed treasure in Castle Greymarch—ten thousand gold coins stamped with a Lich-King's visage. The coins could not be spent or destroyed; their debt compounded daily until Caros owed more than could exist. The Collector claimed him when his flesh had nothing left to offer.",
      "traits": [
        "lucky initially",
        "desperate",
        "doomed"
      ],
      "known_locations": [
        "Castle Greymarch"
      ],
      "affiliations": [
        "the Collector"
      ],
      "notes": "Morthaxes's gold is bound by compound debt magic. The Collector appears as an agent of the Lich-King, tracking cursed wealth across time.",
      "first_story": "The Collector's Due",
      "first_date": "2026-02-27",
      "appearances": 1
    },
    {
      "id": "morg_tomb_keeper",
      "name": "Morg",
      "tagline": "Sworn sentinel. Blood-bound. Digested.",
      "role": "Tomb-Keeper / Guardian",
      "world": "known_world",
      "status": "dead",
      "home_place": "Tomb of Shard-Vêl",
      "home_region": "unknown",
      "home_realm": "unknown",
      "travel_scope": "local",
      "bio": "A tomb-keeper sworn in blood-oath to guard the Tomb of Shard-Vêl for twelve years, part of a lineage of guardians. When the Plague Wars ended and no successors came, the living tomb grew hungry. Morg's oath prevented him from breaking his vow; instead, the tomb consumed him piece by piece, incorporating his bones into its burial chamber.",
      "traits": [
        "loyal to oath",
        "trapped",
        "merged with stone"
      ],
      "known_locations": [
        "Tomb of Shard-Vêl"
      ],
      "affiliations": [
        "tomb-keeper lineage"
      ],
      "notes": "Blood-oaths are magically binding and cannot be broken without severe consequence. The tomb is sentient and patient. Morg's consciousness persists as part of the structure, warning visitors.",
      "first_story": "The Tomb-Keeper's Vigil",
      "first_date": "2026-02-27",
      "appearances": 1
    },
    {
      "id": "sister_kess",
      "name": "Sister Kess",
      "tagline": "Healer-broken. Truth-cursed. Mercy-poisoned.",
      "role": "Novice Nun / Healer",
      "world": "known_world",
      "status": "dead",
      "home_place": "convent",
      "home_region": "unknown",
      "home_realm": "unknown",
      "travel_scope": "local",
      "bio": "A novice sister who broke her vows to seek the Witch of Ravenmoor, desperate to save the plague-village of Carrion's Rest. The witch lifted the plague but cursed Kess with absolute truth—she could never lie again. She saved the village but destroyed herself, unable to offer comfort or hide doubt, each truth shattered faith.",
      "traits": [
        "compassionate",
        "conflicted",
        "curse-bearer"
      ],
      "known_locations": [
        "Carrion's Rest",
        "convent",
        "Ravenmoor"
      ],
      "affiliations": [
        "convent",
        "Witch of Ravenmoor"
      ],
      "notes": "The Witch of Ravenmoor uses blackthorn knives for blood-magic curses. Truth-magic is a form of binding curse. Mercy and honesty can be incompatible burdens.",
      "first_story": "The Witch-Price of Mercy",
      "first_date": "2026-02-27",
      "appearances": 1
    },
    {
      "id": "kessara_sunken_marches",
      "name": "Kessara",
      "tagline": "Regent-widowed. Ghost-bound. Liberated.",
      "role": "Warlord / Regent",
      "world": "known_world",
      "status": "alive",
      "home_place": "Sunken Marches",
      "home_region": "Sunken Marches",
      "home_realm": "unknown",
      "travel_scope": "regional",
      "bio": "A widow who ruled the Sunken Marches in name only while her dead husband Velgrim the Terrible held true power as a practical, vengeful ghost. Rather than submit to his demands for massacre, Kessara performed a ritual of dismissal, sacrificing her claim to the land itself to release his spirit. She departed as a wanderer, leaving the Marches to her husband's eternal rule.",
      "traits": [
        "strategic",
        "willing to sacrifice",
        "independent"
      ],
      "known_locations": [
        "Sunken Marches",
        "Blackthorn"
      ],
      "affiliations": [
        "Velgrim the Terrible (ghost-husband)"
      ],
      "notes": "Dismissal rituals require sacrifice of something precious. Ghosts can be satisfied and released to peace. She chose freedom over power.",
      "first_story": "The Warlord's Widow",
      "first_date": "2026-02-27",
      "appearances": 1
    },
    {
      "id": "master_lethyn",
      "name": "Master Lethyn",
      "tagline": "Alchemist-glutted. Youth-hungry. Inhuman.",
      "role": "Alchemist / Sorcerer",
      "world": "known_world",
      "status": "dead",
      "home_place": "tower",
      "home_region": "unknown",
      "home_realm": "unknown",
      "travel_scope": "local",
      "bio": "An alchemist who perfected a potion of youth through extraction of living flesh. What began as voluntary sacrifice became coerced theft and murder as his hunger grew beyond control. His own transformation into a flesh-eating thing was irreversible; he burned for three days while still consuming, his screams part of his alchemy.",
      "traits": [
        "ambitious",
        "amoral",
        "self-consuming"
      ],
      "known_locations": [
        "tower"
      ],
      "affiliations": [
        "victims"
      ],
      "notes": "Some alchemical transformations cannot be undone, only abandoned to burn. The Great Work of youth-restoration is forbidden knowledge. Alchemy can rewrite morality and nature itself.",
      "first_story": "The Alchemist's Appetite",
      "first_date": "2026-02-27",
      "appearances": 1
    },
    {
      "id": "thorne_grimmholt",
      "name": "Thorne",
      "tagline": "Oath-bound. Rebel. Satisfied.",
      "role": "Fortress Warden / Soldier",
      "world": "known_world",
      "status": "dead",
      "home_place": "Grimmholt",
      "home_region": "unknown",
      "home_realm": "unknown",
      "travel_scope": "local",
      "bio": "A warden sworn by blood-oath to defend Grimmholt fortress against the Rot-King's forces. When the Crown ordered him to surrender the fortress, Thorne faced a choice between breaking his oath or treason. He chose rebellion, sealing the gates and holding against both the Rot-King and royal armies for two years. He died unburdened when his betrayed fortress fell.",
      "traits": [
        "faithful",
        "defiant",
        "self-sacrificing"
      ],
      "known_locations": [
        "Grimmholt"
      ],
      "affiliations": [
        "Rot-King",
        "the Crown"
      ],
      "notes": "Blood-oaths enforce themselves with magic; breaking them causes spiritual death. Sometimes honoring an oath requires breaking every law protecting it. His defiance satisfied the oath's hunger.",
      "first_story": "The Broken Oath",
      "first_date": "2026-02-27",
      "appearances": 1
    },
    {
      "id": "nara_tide_thief",
      "name": "Nara the Tide-Thief",
      "tagline": "Magic-thief. Ocean-hunted. Redeemed.",
      "role": "Thief / Sorcerer",
      "world": "known_world",
      "status": "alive",
      "home_place": "unknown",
      "home_region": "Sapphire Deep",
      "home_realm": "unknown",
      "travel_scope": "interrealm",
      "bio": "A thief who stole water-magic from the merfolk of the Sapphire Deep. Hunted across three continents for years, she learned that the sea cannot be stolen from—only reclaimed. Cornered in the desert city of Vel-Karsh, she bound her stolen magic into a single glass vial and shattered it, transforming the world to settle her debt. The merfolk accepted the reshaping as payment.",
      "traits": [
        "resourceful",
        "desperate",
        "willing to reshape reality"
      ],
      "known_locations": [
        "Sapphire Deep",
        "Vel-Karsh"
      ],
      "affiliations": [
        "merfolk"
      ],
      "notes": "Water-magic is bound to ocean and death. Debts to merfolk scale across continents. Sometimes debts are best settled by changing the world itself.",
      "first_story": "The Tide-Thief's Escape",
      "first_date": "2026-02-27",
      "appearances": 1
    },
    {
      "id": "velgrim_the_terrible",
      "name": "Velgrim the Terrible",
      "tagline": "Ghost-warlord. Persistent. Released.",
      "role": "Ghost / Warlord",
      "world": "known_world",
      "status": "dead",
      "home_place": "Sunken Marches",
      "home_region": "Sunken Marches",
      "home_realm": "unknown",
      "travel_scope": "local",
      "bio": "A powerful warlord who died three seasons before the events of his story but refused to pass into final death. His ghost manifested as a practical, demanding presence in the Sunken Marches, directing sieges and collecting tribute. He was finally released to peaceful death when his widow Kessara sacrificed her claim to the throne.",
      "traits": [
        "persistent",
        "practical",
        "honour-bound"
      ],
      "known_locations": [
        "Sunken Marches"
      ],
      "affiliations": [
        "Kessara",
        "his generals"
      ],
      "notes": "Ghosts can persist in the material world through force of will or unfinished business. They can be satisfied and released through appropriate ritual sacrifice.",
      "first_story": "The Warlord's Widow",
      "first_date": "2026-02-27",
      "appearances": 1
    },
    {
      "id": "varak_ironhelm",
      "name": "Varak Ironhelm",
      "aliases": [
        "Varak"
      ],
      "tagline": "Conquered. Possessed. Consumed.",
      "role": "Warlord / General",
      "world": "known_world",
      "status": "cursed",
      "home_place": "unknown",
      "home_region": "unknown",
      "home_realm": "unknown",
      "travel_scope": "unknown",
      "bio": "A general who led eight hundred warriors to breach the Ossuary's gates in what he believed would be a conquest. Instead, the fortress chose him as a vessel, wearing his flesh like a glove while his consciousness remained trapped within. His final act was to turn his sword against his own surviving soldiers.",
      "traits": [
        "ambitious",
        "doomed",
        "possessed"
      ],
      "known_locations": [
        "the Ossuary"
      ],
      "affiliations": [
        "the Ossuary"
      ],
      "notes": "Now serves as the will of the Ossuary made manifest. His body is a puppet; his mind is imprisoned within.",
      "first_story": "The Bone Citadel's Hunger",
      "first_date": "2026-02-28",
      "appearances": 1
    },
    {
      "id": "torvin",
      "name": "Torvin",
      "aliases": [],
      "tagline": "Desperate. Hollow. Aging.",
      "role": "Merchant",
      "world": "known_world",
      "status": "active",
      "home_place": "unknown",
      "home_region": "unknown",
      "home_realm": "unknown",
      "travel_scope": "local",
      "bio": "A merchant who bargained five years of his life to a demon named Varek to save his daughter from illness. Though his life was restored through Kira's ritual magic, he was left hollow-eyed and eternally stripped of the certainty that his daughter truly loves him.",
      "traits": [
        "desperate",
        "sacrificial",
        "cursed-by-doubt"
      ],
      "known_locations": [
        "merchant's house"
      ],
      "affiliations": [
        "Varek",
        "Kira"
      ],
      "notes": "The cost of his salvation was his own certainty and peace of mind. A warning about the true price of demonic bargains.",
      "first_story": "The Weight of Stolen Years",
      "first_date": "2026-02-28",
      "appearances": 1
    },
    {
      "id": "kira_sorceress",
      "name": "Kira",
      "aliases": [
        "Sorceress Kira"
      ],
      "tagline": "Cunning. Ingenious. Merciless.",
      "role": "Sorceress",
      "world": "known_world",
      "status": "active",
      "home_place": "unknown",
      "home_region": "unknown",
      "home_realm": "unknown",
      "travel_scope": "interrealm",
      "bio": "A sorceress who followed Varek to intercept a demonic bargain and reverse-engineered his method of stealing time itself. She performs a ritual to restore Torvin's years but exacts a terrible price: his certainty. She forms a partnership with the impressed demon Varek.",
      "traits": [
        "ingenious",
        "merciless",
        "calculating"
      ],
      "known_locations": [
        "merchant's house"
      ],
      "affiliations": [
        "Varek"
      ],
      "notes": "Her ritual burned through the night. She masters temporal magic and begins a mysterious partnership with Varek. Her methods suggest deep knowledge of demonic arts.",
      "first_story": "The Weight of Stolen Years",
      "first_date": "2026-02-28",
      "appearances": 1
    },
    {
      "id": "vex_shade_merchant",
      "name": "Vex the Shade-Merchant",
      "aliases": [
        "Vex"
      ],
      "tagline": "Clever. Doomed. Trapped.",
      "role": "Merchant / Thief",
      "world": "known_world",
      "status": "cursed",
      "home_place": "Pelimor",
      "home_region": "unknown",
      "home_realm": "unknown",
      "travel_scope": "regional",
      "bio": "A merchant and thief who stole a fortune in shadows from a dying sorcerer's vault and attempted to sell them in Pelimor's night markets. He was outwitted by a cloaked woman who had purchased back his own shadow—worn by a malevolent entity tracking his crimes—and was compelled northward and eastward into unknown wastes.",
      "traits": [
        "clever",
        "criminal",
        "doomed"
      ],
      "known_locations": [
        "Pelimor",
        "Pelimor's night markets"
      ],
      "affiliations": [
        "unknown cloaked woman"
      ],
      "notes": "Now driven northward and eastward by his own shadow, compelled by a force he cannot resist. His remaining stock was sold by morning, suggesting his shadow may continue to circulate. A cautionary tale about the dangers of shadow dealing.",
      "first_story": "The Shade-Merchant's Gambit",
      "first_date": "2026-02-28",
      "appearances": 1
    },
    {
      "id": "naresh_the_bone_carver",
      "name": "Naresh the Bone Carver",
      "aliases": [
        "Naresh"
      ],
      "tagline": "Hollow. Sacrificed. Transcendent.",
      "role": "Bone Carver, Ritualist",
      "world": "known_world",
      "status": "cursed",
      "home_place": "unknown",
      "home_region": "unknown",
      "home_realm": "unknown",
      "travel_scope": "unknown",
      "bio": "Naresh spent twenty years perfecting the art of animating the dead through bone carving. On the night of a blue eclipse, she performed a ritual that created a truly sentient skeleton—but at the cost of her own humanity. She sacrificed her memories, emotions, and capacity for joy to give her creation life.",
      "traits": [
        "obsessive",
        "self-sacrificing",
        "hollow",
        "purposeful"
      ],
      "known_locations": [
        "wasteland"
      ],
      "affiliations": [],
      "notes": "Her skeleton creation asks 'What is joy?' suggesting it may pursue its creator or seek understanding of human emotion. Naresh walks as a shell containing only purpose—unresolved what her purpose now is.",
      "first_story": "The Carver's Final Work",
      "first_date": "2026-02-28",
      "appearances": 1
    },
    {
      "id": "naresh_skeleton",
      "name": "Naresh's Skeleton",
      "aliases": [
        "The Skeleton",
        "Naresh's Creation"
      ],
      "tagline": "Sentient. Weeping. Yearning.",
      "role": "Animated Construct, Undead",
      "world": "known_world",
      "status": "active",
      "home_place": "unknown",
      "home_region": "unknown",
      "home_realm": "unknown",
      "travel_scope": "unknown",
      "bio": "Created by Naresh through a ritual on the night of the blue eclipse, this skeleton is the first of its kind—truly alive, capable of learning, yearning, and growth. It was carved with lungs that breathe, a heart-bone that beats, and an ivory mind that *wants* beyond mere compulsion. Upon drawing its first breath, it wept and asked its creator what joy is.",
      "traits": [
        "sentient",
        "curious",
        "sorrowful",
        "innocent"
      ],
      "known_locations": [
        "wasteland"
      ],
      "affiliations": [
        "Naresh the Bone Carver"
      ],
      "notes": "Its first question reveals existential confusion. May seek other sentient beings or pursue its creator seeking answers about emotion and purpose.",
      "first_date": "2026-02-28",
      "appearances": 1
    },
    {
      "id": "kestran",
      "name": "Kestran",
      "aliases": [],
      "tagline": "Haunted. Penitent. Redeemed.",
      "role": "Blademaster, Warrior",
      "world": "known_world",
      "status": "active",
      "home_place": "unknown",
      "home_region": "unknown",
      "home_realm": "unknown",
      "travel_scope": "regional",
      "bio": "A deadly swordsman who killed forty men in single combat, Kestran swore no oaths to his victims and carried the weight of his blood-debts as abstract guilt. When the ghosts of his kills began manifesting, he was forced to acknowledge each death with genuine contrition and belated oaths of release. After weeks of spectral combat and accumulated remorse, he sheathed his sword forever.",
      "traits": [
        "skilled",
        "haunted",
        "remorseful",
        "disciplined"
      ],
      "known_locations": [
        "rain-soaked road"
      ],
      "affiliations": [],
      "notes": "Swore never to draw his sword again. The mechanism of ghost release via oath-swearing may have broader implications for how debt and redemption function in this world. Currently a pacifist with unmatched combat training.",
      "first_story": "The Blademaster's Last Duel",
      "first_date": "2026-02-28",
      "appearances": 1
    },
    {
      "id": "soroth",
      "name": "Soroth",
      "aliases": [
        "the Brigand"
      ],
      "tagline": "Damned. Aged. Enslaved.",
      "role": "Brigand, Warlord, Collector",
      "world": "known_world",
      "status": "cursed",
      "home_place": "Crimson Vale",
      "home_region": "Crimson Vale",
      "home_realm": "unknown",
      "travel_scope": "regional",
      "bio": "A brigand who found three hundred pieces of Malachar's gold in a tomb and used them to establish himself as warlord of the Crimson Vale. When supernatural collectors arrived to collect Malachar's eternal debt, Soroth aged rapidly as they extracted years from his life. Faced with the choice of death or damnation, he accepted servitude as one of their agents, collecting debts from others in the living world.",
      "traits": [
        "ambitious",
        "cursed",
        "enslaved",
        "corrupted"
      ],
      "known_locations": [
        "Crimson Vale",
        "tomb"
      ],
      "affiliations": [
        "Malachar's Collectors"
      ],
      "notes": "Now walks the world as a collector himself, spreading fear wherever he goes. The mechanics of Malachar's debt—compounding in blood, loyalty, and life-years—may be a systemic curse affecting other coin holders.",
      "first_story": "The Lich-King's Collectors",
      "first_date": "2026-02-28",
      "appearances": 1
    },
    {
      "id": "malachar",
      "name": "Malachar",
      "aliases": [],
      "tagline": "Dead. Creditor. Eternal.",
      "role": "Lich-King, Necromancer",
      "world": "known_world",
      "status": "dead",
      "home_place": "unknown",
      "home_region": "unknown",
      "home_realm": "unknown",
      "travel_scope": "unknown",
      "bio": "A lich-king or powerful undead entity whose gold coins carry supernatural debts. Though apparently dead, Malachar's will persists through his collectors—neither living nor dead entities that enforce eternal debts upon those who possess his coins.",
      "traits": [
        "undead",
        "creditor",
        "vengeful",
        "eternal"
      ],
      "known_locations": [
        "tomb"
      ],
      "affiliations": [
        "Malachar's Collectors"
      ],
      "notes": "The source and nature of Malachar's power is unclear. The collectors act as his autonomous agents centuries after his death, suggesting either a powerful binding curse or continuing consciousness. The gold's origins and how many pieces exist is unknown.",
      "first_story": "The Lich-King's Collectors",
      "first_date": "2026-02-28",
      "appearances": 1
    },
    {
      "id": "malachars_lead_collector",
      "name": "Lead Collector",
      "aliases": [
        "The Lead Collector",
        "Malachar's Lead Collector"
      ],
      "tagline": "Gray. Hollow-eyed. Merciless.",
      "role": "Collector, Undead Agent",
      "world": "known_world",
      "status": "active",
      "home_place": "unknown",
      "home_region": "unknown",
      "home_realm": "unknown",
      "travel_scope": "unknown",
      "bio": "The primary collector who negotiated with Soroth. Neither living nor dead, this entity wears nobility like ill-fitting clothes. It offered Soroth a choice: death now or eternal servitude as a collector in the living world. It has empty eyes and laughs at the notion of paying Malachar's debts in gold.",
      "traits": [
        "merciless",
        "inhuman",
        "authoritative",
        "patient"
      ],
      "known_locations": [
        "Crimson Vale"
      ],
      "affiliations": [
        "Malachar's Collectors"
      ],
      "notes": "Represents the apex of Malachar's enforcement apparatus. Its statement that 'Gold cannot pay a debt to the dead' suggests a metaphysical law underlying the curse system.",
      "first_story": "The Lich-King's Collectors",
      "first_date": "2026-02-28",
      "appearances": 1
    },
    {
      "id": "prince_aldren",
      "name": "Prince Aldren",
      "aliases": [
        "Aldren"
      ],
      "tagline": "Dutiful. Negotiator. Sacrifice.",
      "role": "Prince, Dragon's Consort",
      "world": "known_world",
      "status": "active",
      "home_place": "unknown",
      "home_region": "unknown",
      "home_realm": "unknown",
      "travel_scope": "realmwide",
      "bio": "Prince Aldren rode to meet the dragon Skyrakis expecting death, but was offered a choice: wed the dragon's daughter and rule in the crystal halls beneath the world, or see his kingdom burn. He accepted and negotiated a counter-oath ensuring his future children could choose their own path. He now dwells in the crystal halls, having traded his human kingdom for a life of honor and duty.",
      "traits": [
        "honorable",
        "negotiator",
        "self-sacrificing",
        "dutiful"
      ],
      "known_locations": [
        "crystal halls"
      ],
      "affiliations": [
        "Skyrakis the Wound-Wing",
        "his father (unnamed)",
        "merchant's daughter (bride-to-be, unnamed)"
      ],
      "notes": "His acceptance of the oath binds him to the dragon's daughter and their hybrid line. The counter-oath he swore creates a precedent for wyvern-blooded heirs to have free choice.",
      "first_story": "The Dragon's Bargain",
      "first_date": "2026-02-28",
      "appearances": 1
    },
    {
      "id": "skyrakis_the_wound_wing",
      "name": "Skyrakis the Wound-Wing",
      "aliases": [
        "Skyrakis"
      ],
      "tagline": "Ancient. Terrible. Honorable.",
      "role": "Dragon, Oath-Keeper",
      "world": "known_world",
      "status": "active",
      "home_place": "crystal halls",
      "home_region": "unknown",
      "home_realm": "unknown",
      "travel_scope": "realmwide",
      "bio": "A great dragon whose grandmother made an ancient blood-marriage oath with Prince Aldren's family. When Aldren's father broke this oath, Skyrakis sought redress, threatening to burn the kingdom unless a prince would wed his daughter and rule in the crystal halls beneath the world. She respects negotiation and honor.",
      "traits": [
        "ancient",
        "patient",
        "terrible",
        "oath-bound",
        "respects courage"
      ],
      "known_locations": [
        "crystal halls"
      ],
      "affiliations": [
        "her daughter (unnamed)",
        "Prince Aldren (now son-in-law)"
      ],
      "notes": "Her grandmother swore the original blood-marriage oath with Aldren's family generations ago. She has a daughter coming of age.",
      "first_story": "The Dragon's Bargain",
      "first_date": "2026-02-28",
      "appearances": 1
    },
    {
      "id": "mira_the_shadow_dancer",
      "name": "Mira the Shadow-Dancer",
      "aliases": [
        "Mira"
      ],
      "tagline": "Cunning. Reckless. Reformed.",
      "role": "Thief",
      "world": "known_world",
      "status": "active",
      "home_place": "Pelimor",
      "home_region": "unknown",
      "home_realm": "unknown",
      "travel_scope": "local",
      "bio": "Mira is a legendary thief with a unique problem: her own shadow betrayed her in daylight. She bought a replacement shadow in Pelimor's night markets—a merchant's stolen shadow—and used it for three months until the shadow's own will and grief manifested, nearly forcing her to betray a robbery. She burned the shadow to escape its compulsion and learned that shadows carry memory and cannot be truly owned.",
      "traits": [
        "skilled",
        "cunning",
        "resourceful",
        "haunted",
        "reformed"
      ],
      "known_locations": [
        "Pelimor"
      ],
      "affiliations": [
        "the merchant (unnamed, shadow's original owner)"
      ],
      "notes": "She now avoids stealing shadows and focuses only on daylight treasures. Her encounter revealed that shadows retain memory and agency.",
      "first_story": "The Thief's Shadow",
      "first_date": "2026-02-28",
      "appearances": 1
    },
    {
      "id": "tormund",
      "name": "Tormund",
      "aliases": [],
      "tagline": "Oath-Breaker. Hollow. Redeemed.",
      "role": "King",
      "world": "known_world",
      "status": "dead",
      "home_place": "throne room",
      "home_region": "unknown",
      "home_realm": "unknown",
      "travel_scope": "realmwide",
      "bio": "Tormund was a careless king who broke oaths repeatedly—promising lands not his to give, betraying allies, dishonoring marriages. A curse took from him one irreplaceable thing per broken oath: taste, laughter, memory of his son. By his twentieth broken oath, he was a hollow ghost. He sought the cursewright's heir in the wastelands, who told him the curse could not be bought away but only undone through keeping new oaths. He spent his final years keeping small promises to small people and died in peace.",
      "traits": [
        "reckless",
        "oath-breaker",
        "hollow",
        "penitent",
        "haunted"
      ],
      "known_locations": [
        "throne room",
        "wastelands"
      ],
      "affiliations": [
        "his sister (unnamed)",
        "his ally (unnamed, betrayed)",
        "his firstborn son (unnamed)",
        "the cursewright's heir (unnamed)"
      ],
      "notes": "His curse is an elegant curse by the cursewright—each broken oath steals something irreplaceable. He achieved redemption through small acts of honor in his final years.",
      "first_story": "The Oath-Breaker's Curse",
      "first_date": "2026-02-28",
      "appearances": 1
    },
    {
      "id": "the_cursewright_s_heir",
      "name": "the cursewright's heir",
      "aliases": [
        "cursewright's heir"
      ],
      "tagline": "Wise. Hermitic. Teacher.",
      "role": "Hermit, Wise Woman",
      "world": "known_world",
      "status": "active",
      "home_place": "wastelands",
      "home_region": "unknown",
      "home_realm": "unknown",
      "travel_scope": "local",
      "bio": "A young woman living as a hermit in the wastelands, she is the heir to the cursewright who placed the elegant curse upon King Tormund. She refused to lift his curse but instead taught him that oaths are not chains but bonds forged with others, and that redemption comes through keeping new promises.",
      "traits": [
        "wise",
        "compassionate",
        "teacher",
        "patient"
      ],
      "known_locations": [
        "wastelands"
      ],
      "affiliations": [
        "the original cursewright (ancestor)",
        "King Tormund"
      ],
      "notes": "She is heir to the cursewright's craft but chooses to teach rather than curse.",
      "first_story": "The Oath-Breaker's Curse",
      "first_date": "2026-02-28",
      "appearances": 1
    },
    {
      "id": "lyssa",
      "name": "Lyssa",
      "aliases": [],
      "tagline": "Archaeologist. Consumed. Transformed.",
      "role": "Archaeologist",
      "world": "known_world",
      "status": "cursed",
      "home_place": "unknown",
      "home_region": "unknown",
      "home_realm": "unknown",
      "travel_scope": "local",
      "bio": "An archaeologist who discovered the ruins of Aethermarch and was drawn into its memory-stones. Over weeks of mapping and touching the walls, she absorbed vast archives of ancient knowledge but at the cost of her own identity. She escaped the city's call but was fundamentally altered, her mind partially replaced by the memories of dead architects.",
      "traits": [
        "curious",
        "scholarly",
        "mentally fragmented",
        "haunted",
        "resistant"
      ],
      "known_locations": [
        "Aethermarch",
        "desert's edge"
      ],
      "affiliations": [],
      "notes": "Lyssa's transformation is incomplete—she survives but can never return to Aethermarch. The city's siren-song continues to call to her. She now speaks ancient languages and possesses skills she never learned. Her humanity is in tension with the vast remembrance that partially inhabits her mind.",
      "first_story": "The City That Remembers",
      "first_date": "2026-02-28",
      "appearances": 1
    },
    {
      "id": "kess_drowned_hollows",
      "name": "Kess of the Drowned Hollows",
      "aliases": [
        "Kess of the Drowned Hollows",
        "Kess"
      ],
      "tagline": "Silent. Sacrifice. Songkeeper.",
      "role": "Bone-singer",
      "world": "known_world",
      "status": "active",
      "home_place": "Drowned Hollows",
      "home_region": "Drowned Hollows",
      "home_realm": "unknown",
      "travel_scope": "local",
      "bio": "Kess is a bone-singer of the Drowned Hollows who preserved her village from the Rot-King's plague by bargaining with a wolf-spirit—trading her voice for the lives of her people. She now teaches the old songs through gesture and hand-craft, her throat burned by ancient magic. Her sacrifice transformed her from a keeper of tradition into a living testament to the cost of salvation.",
      "traits": [
        "silent",
        "self-sacrificial",
        "ritualist",
        "keeper-of-old-ways",
        "mute-but-eloquent"
      ],
      "known_locations": [
        "Drowned Hollows",
        "deep forest"
      ],
      "affiliations": [
        "wolf-spirit (spirit ally)"
      ],
      "notes": "Her bargain with the wolf-spirit raises questions about what debts remain unpaid or might call on her in future. The old songs she now teaches suggest a deeper connection to pre-kingdom magic systems.",
      "first_story": "The Bone-Singer's Lament",
      "first_date": "2026-03-01",
      "appearances": 2
    },
    {
      "id": "mardoc_cartographer",
      "name": "Mardoc the Cartographer",
      "aliases": [
        "Mardoc"
      ],
      "tagline": "Curious. Chronicler. Diplomat.",
      "role": "Cartographer",
      "world": "known_world",
      "status": "active",
      "home_place": "unknown",
      "home_region": "unknown",
      "home_realm": "unknown",
      "travel_scope": "interrealm",
      "bio": "Mardoc is a renowned cartographer who has mapped half the Known World and descended into the Sunken Caverns to map the Lamia's realm. Rather than confront the Lamia with steel, he offered her something more valuable: eternal witness through his maps and her true name inscribed in silver leaf. His success transformed him into a legend and reshaped how the world perceives the Lamia.",
      "traits": [
        "curious",
        "clever-tongued",
        "fearless",
        "diplomatic",
        "ambitious"
      ],
      "known_locations": [
        "Known World",
        "Sunken Caverns",
        "taverns across the world"
      ],
      "affiliations": [
        "the Lamia (diplomatic ally)"
      ],
      "notes": "His maps have become legend and are whispered about in taverns. The power of his work lies in bearing witness rather than conquest. Unresolved: what other blank maps remain in his collection, and what other sovereigns might seek his chronicling?",
      "first_story": "The Cartographer's Gambit",
      "first_date": "2026-03-01",
      "appearances": 1
    },
    {
      "id": "silene",
      "name": "Silene",
      "aliases": [
        "Silene the Bright"
      ],
      "tagline": "Forger. Thief. Reborn.",
      "role": "Shadow-broker, Steel-forger",
      "world": "known_world",
      "status": "active",
      "home_place": "unknown",
      "home_region": "unknown",
      "home_realm": "unknown",
      "travel_scope": "unknown",
      "bio": "Silene is the daughter of Kael the Nameless, a legendary shadow-broker. Rejecting her father's path of shadow-trading, she was forced to enter that world when threatened with her master's burning. She stole a shadow from the Collectors themselves using steel and cunning, bound it into her father's ledger, and forged her own identity as Silene the Bright—a shadow-broker who deals in truth rather than darkness.",
      "traits": [
        "resourceful",
        "defiant",
        "steel-crafted",
        "truth-seeker",
        "clever"
      ],
      "known_locations": [
        "unknown"
      ],
      "affiliations": [
        "Kael the Nameless (father)",
        "Collectors (current collateral relationship)",
        "her master (rescued)"
      ],
      "notes": "She has bound a stolen shadow into her father's ledger as collateral with the Collectors, which could be a future vulnerability or power source. Her transition from forge-work to shadow-brokery marks a significant identity shift. Unresolved: what is the nature of the shadow she stole, and how might the Collectors demand it back?",
      "first_story": "The Thief-Lord's Daughter",
      "first_date": "2026-03-01",
      "appearances": 1
    },
    {
      "id": "rot_king",
      "name": "Rot-King",
      "aliases": [],
      "tagline": "Plague. Corruption. Decay.",
      "role": "Plague-bearer, Antagonist",
      "world": "known_world",
      "status": "defeated",
      "home_place": "unknown",
      "home_region": "unknown",
      "home_realm": "unknown",
      "travel_scope": "regional",
      "bio": "The Rot-King is the source or vector of a septic plague that threatened to blacken and destroy the village of Drowned Hollows. The plague was lifted through Kess's bargain with the wolf-spirit, but the Rot-King's nature and current state remain mysterious.",
      "traits": [
        "pestilential",
        "corrupting",
        "lethal"
      ],
      "known_locations": [
        "Drowned Hollows (vector of plague)"
      ],
      "affiliations": [],
      "notes": "Whether the Rot-King was a sentient entity, a curse, or a force of nature is unclear. The plague's cessation through the wolf-spirit's intervention suggests either the Rot-King's death or withdrawal, but its origin and ultimate fate are unknown.",
      "first_story": "The Bone-Singer's Lament",
      "first_date": "2026-03-01",
      "appearances": 1
    },
    {
      "id": "lamia",
      "name": "Lamia",
      "aliases": [
        "the Lamia"
      ],
      "tagline": "Sovereign. Lonely. Witnessed.",
      "role": "Spirit-sovereign, Guardian",
      "world": "known_world",
      "status": "active",
      "home_place": "Sunken Caverns",
      "home_region": "Sunken Caverns",
      "home_realm": "unknown",
      "travel_scope": "local",
      "bio": "The Lamia is a guardian spirit of the Sunken Caverns, coiled around a throne of bone. For centuries she was known only as a monster to be feared, watched only by the dead. Mardoc's arrival transformed her perception: by offering her eternal witness through his maps and inscribing her true name in silver leaf, he gave her sovereignty and choice. She now appears in taverns across the world not as a monster but as a sovereign.",
      "traits": [
        "ancient",
        "lonely",
        "proud",
        "laughing (like breaking glass and singing whales)",
        "now-witnessed"
      ],
      "known_locations": [
        "Sunken Caverns"
      ],
      "affiliations": [
        "Mardoc the Cartographer (diplomatic ally)"
      ],
      "notes": "Her laugh is described as 'a sound like breaking glass and singing whales.' She maintains gardens of bioluminescent coral and a vault of pearls in her caverns. Her transformation from feared monster to recognized sovereign is a pivotal moment in how the world perceives non-human rulers. Unresolved: does her new recognition bring her greater power or new vulnerabilities?",
      "first_story": "The Cartographer's Gambit",
      "first_date": "2026-03-01",
      "appearances": 2
    },
    {
      "id": "wolf_spirit",
      "name": "Wolf-spirit",
      "aliases": [],
      "tagline": "Antlered. Bargaining. Merciful.",
      "role": "Spirit, Covenant-maker",
      "world": "known_world",
      "status": "active",
      "home_place": "deep forest",
      "home_region": "unknown",
      "home_realm": "unknown",
      "travel_scope": "local",
      "bio": "The wolf-spirit is an ancient being of the deep forest, antlered and terrible in appearance, that emerged from shadow to bargain with Kess. It offered her the lifting of the Rot-King's plague in exchange for her voice—a debt paid in silence. The spirit represents the old magic that predates kingdoms.",
      "traits": [
        "ancient",
        "merciful",
        "bargain-keeper",
        "antlered",
        "shadowy"
      ],
      "known_locations": [
        "deep forest"
      ],
      "affiliations": [
        "Kess (covenant partner)"
      ],
      "notes": "The spirit's nature and true motives remain mysterious. Whether it acted from compassion or pursued some deeper agenda is unclear. The exchange of voice for salvation suggests a careful balance in spirit-magic economics.",
      "first_story": "The Bone-Singer's Lament",
      "first_date": "2026-03-01",
      "appearances": 1
    },
    {
      "id": "lady_thressa",
      "name": "Lady Thressa",
      "aliases": [
        "Thressa"
      ],
      "tagline": "Voiceless. Grieving. Resolute.",
      "role": "Widow; Sacrifice",
      "world": "known_world",
      "status": "active",
      "home_place": "unknown",
      "home_region": "unknown",
      "home_realm": "unknown",
      "travel_scope": "local",
      "bio": "A widow at twenty-three whose husband fell to rot-plague, Thressa made a bargain with the Emperor's alchemist: her tongue in exchange for restoration honey to resurrect him. She drank the elixir without hesitation, watching her husband rise as an undead, ravenous thing. When his hunger became unbearable, she burned his portrait and wrote his name in her own blood across his grave, shattering the alchemy—but losing her voice forever.",
      "traits": [
        "selfless",
        "silent",
        "determined",
        "tragic"
      ],
      "known_locations": [
        "village"
      ],
      "affiliations": [
        "Emperor's alchemist"
      ],
      "notes": "Thressa is now permanently voiceless, unable to speak her late husband's name or any other words. The Emperor's alchemist gained proof that the restoration magic works. Unresolved: whether Thressa survives the encounter with her undead husband, or if she continues to live in isolation.",
      "first_story": "The Widow's Bargain",
      "first_date": "2026-03-01",
      "appearances": 1
    },
    {
      "id": "emperors_alchemist",
      "name": "Emperor's alchemist",
      "aliases": [],
      "tagline": "Cunning. Manipulative. Practical.",
      "role": "Alchemist; Schemer",
      "world": "known_world",
      "status": "active",
      "home_place": "unknown",
      "home_region": "unknown",
      "home_realm": "unknown",
      "travel_scope": "unknown",
      "bio": "An alchemist in service to the Emperor who offers Thressa restoration honey—a potion capable of undoing death itself. The alchemist's price is her tongue, claiming that names anchor the living to the world and must be removed for the magic to hold true. The alchemist's true goal is to use Thressa as an unwitting test subject to prove the resurrection magic works.",
      "traits": [
        "cunning",
        "callous",
        "knowledgeable",
        "manipulative"
      ],
      "known_locations": [
        "unknown"
      ],
      "affiliations": [
        "Emperor"
      ],
      "notes": "The alchemist's ultimate motivation is unclear—whether they serve the Emperor directly or pursue alchemy for personal gain. They successfully used Thressa's desperation to validate their magic.",
      "first_story": "The Widow's Bargain",
      "first_date": "2026-03-01",
      "appearances": 1
    },
    {
      "id": "tory_the_redhand",
      "name": "Tory the Redhand",
      "aliases": [
        "Tory"
      ],
      "tagline": "Cunning. Ruthless. Pragmatic.",
      "role": "Thief; Crew Leader",
      "world": "known_world",
      "status": "active",
      "home_place": "unknown",
      "home_region": "Ashen Wastes",
      "home_realm": "unknown",
      "travel_scope": "regional",
      "bio": "A thief and crew leader who led an expedition across the Scorched Flats to recover the Crown of Karesh from the Ruins of Old Keth. Motivated by a merchant-prince's promise of one million gold pieces, Tory assembled a skilled crew and successfully breached the crown-vault, but abandoned her teammate Gareth when the curse began to seep into his blood, sending him north with the crown while she vanished into the wastes.",
      "traits": [
        "bold",
        "ruthless",
        "practical",
        "decisive"
      ],
      "known_locations": [
        "Scorched Flats",
        "Ruins of Old Keth"
      ],
      "affiliations": [
        "Gareth",
        "Mell",
        "Kovin",
        "merchant-prince"
      ],
      "notes": "Tory prioritizes crew survival over loyalty—she freed Gareth from his oath to spare the others. Her current whereabouts are unknown. The outcome of Gareth's curse is unresolved.",
      "first_story": "The Crown-Thief of Ashen Wastes",
      "first_date": "2026-03-01",
      "appearances": 1
    },
    {
      "id": "gareth",
      "name": "Gareth",
      "aliases": [],
      "tagline": "Skilled. Cursed. Doomed.",
      "role": "Locksmith; Dwarf",
      "world": "known_world",
      "status": "cursed",
      "home_place": "Deepvault",
      "home_region": "unknown",
      "home_realm": "unknown",
      "travel_scope": "regional",
      "bio": "A dwarf locksmith who worked the Deepvault and was recruited by Tory to breach the crown-vault at the Ruins of Old Keth. Gareth successfully used meteor-iron lockpicks to open the vault, but proximity to the Crown of Karesh caused its curse to seep into his blood. Released from his oath by Tory, he limped northward carrying the crown-wrapped bundle, tasked with breaking the curse however he could.",
      "traits": [
        "skilled",
        "weakening",
        "determined",
        "doomed"
      ],
      "known_locations": [
        "Deepvault",
        "Ruins of Old Keth",
        "Scorched Flats"
      ],
      "affiliations": [
        "Tory",
        "Mell",
        "Kovin"
      ],
      "notes": "Gareth's current fate is unknown. He was sent north with the Crown of Karesh while cursed—whether he succeeded in breaking the curse, reached the merchant-prince, or succumbed to the affliction remains unresolved.",
      "first_story": "The Crown-Thief of Ashen Wastes",
      "first_date": "2026-03-01",
      "appearances": 1
    },
    {
      "id": "mell",
      "name": "Mell",
      "aliases": [],
      "tagline": "Fae-blooded. Sharp-eyed. Loyal.",
      "role": "Scout; Fae-touched",
      "world": "known_world",
      "status": "active",
      "home_place": "unknown",
      "home_region": "Ashen Wastes",
      "home_realm": "unknown",
      "travel_scope": "regional",
      "bio": "A scout with fae-blood who could see in starlight and sense magical dangers. Recruited by Tory for the crown-vault expedition, Mell used her fae-sight to navigate around the vault's animate statues and facilitate the successful theft of the Crown of Karesh. She escaped with Tory into the Scorched Flats after the heist.",
      "traits": [
        "perceptive",
        "magical",
        "skilled",
        "loyal"
      ],
      "known_locations": [
        "Scorched Flats",
        "Ruins of Old Keth"
      ],
      "affiliations": [
        "Tory",
        "Gareth",
        "Kovin"
      ],
      "notes": "Mell's current whereabouts are unknown; she vanished into the Scorched Flats with Tory after abandoning Gareth with the crown.",
      "first_story": "The Crown-Thief of Ashen Wastes",
      "first_date": "2026-03-01",
      "appearances": 1
    },
    {
      "id": "kovin",
      "name": "Kovin",
      "aliases": [],
      "tagline": "Bound. Skilled. Oathsworn.",
      "role": "Sellsword; Oathbound",
      "world": "known_world",
      "status": "active",
      "home_place": "unknown",
      "home_region": "Ashen Wastes",
      "home_realm": "unknown",
      "travel_scope": "regional",
      "bio": "A sellsword bound to Tory by oath who participated in the crown-vault heist. Kovin helped breach the Ruins of Old Keth and escape with the Crown of Karesh, vanishing into the Scorched Flats with Tory and Mell after abandoning Gareth.",
      "traits": [
        "oathbound",
        "skilled",
        "loyal",
        "pragmatic"
      ],
      "known_locations": [
        "Scorched Flats",
        "Ruins of Old Keth"
      ],
      "affiliations": [
        "Tory",
        "Gareth",
        "Mell"
      ],
      "notes": "Kovin's current whereabouts are unknown. The oath binding him to Tory remains unresolved.",
      "first_story": "The Crown-Thief of Ashen Wastes",
      "first_date": "2026-03-01",
      "appearances": 1
    },
    {
      "id": "merchant_prince",
      "name": "merchant-prince",
      "aliases": [],
      "tagline": "Wealthy. Cautious. Secretive.",
      "role": "Noble; Collector",
      "world": "known_world",
      "status": "active",
      "home_place": "unknown",
      "home_region": "unknown",
      "home_realm": "unknown",
      "travel_scope": "unknown",
      "bio": "A merchant-prince who hid the Crown of Karesh not to wear it himself but to keep it from the Lich-King's collectors. He offered one million gold pieces to any crew that could retrieve the crown from the Ruins of Old Keth within the new moon, hiring Tory and her team for the job.",
      "traits": [
        "wealthy",
        "cautious",
        "secretive",
        "political"
      ],
      "known_locations": [
        "unknown"
      ],
      "affiliations": [
        "Tory",
        "Gareth",
        "Mell",
        "Kovin"
      ],
      "notes": "The merchant-prince's motivations regarding the Crown of Karesh are political—likely to prevent the Lich-King from acquiring it. Whether he received the crown from Gareth is unresolved.",
      "first_story": "The Crown-Thief of Ashen Wastes",
      "first_date": "2026-03-01",
      "appearances": 1
    },
    {
      "id": "lich_king",
      "name": "Lich-King",
      "aliases": [],
      "tagline": "Undead. Collecting. Powerful.",
      "role": "Undead Monarch; Collector",
      "world": "known_world",
      "status": "active",
      "home_place": "unknown",
      "home_region": "unknown",
      "home_realm": "unknown",
      "travel_scope": "unknown",
      "bio": "A powerful undead ruler whose collectors actively seek cursed and magical crowns, including the Crown of Karesh. The Lich-King's interest in the Crown of Karesh motivated the merchant-prince to hide it and hire Tory's crew to secure it.",
      "traits": [
        "undead",
        "powerful",
        "ambitious",
        "mysterious"
      ],
      "known_locations": [
        "unknown"
      ],
      "affiliations": [
        "unknown"
      ],
      "notes": "The Lich-King's identity, realm, and full ambitions are unresolved. His collectors' reach suggests significant power and influence.",
      "first_story": "The Crown-Thief of Ashen Wastes",
      "first_date": "2026-03-01",
      "appearances": 1
    },
    {
      "id": "captain_nerida",
      "name": "Captain Nerida",
      "aliases": [
        "Nerida"
      ],
      "tagline": "Defiant. Transformed. Bound.",
      "role": "Captain; Merfolk-bound",
      "world": "known_world",
      "status": "active",
      "home_place": "port",
      "home_region": "unknown",
      "home_realm": "unknown",
      "travel_scope": "interrealm",
      "bio": "A sea captain who stole a pearl from the Lamia's vault twenty years ago as proof of survival, incurring a magical debt with the merfolk. When the merfolk came to collect, Nerida dove into the sea before they could choose her crew's fate, accepting transformation into a merfolk form with gills and enhanced deep-sight. She now captains a deep-navy vessel for the merfolk, bound by magic and debt, but surfaces near her old crew's port monthly to leave carved coral messages.",
      "traits": [
        "defiant",
        "selfless",
        "transformed",
        "bound"
      ],
      "known_locations": [
        "Sunken Caverns",
        "port",
        "deep-sea cities"
      ],
      "affiliations": [
        "crew",
        "Lamia",
        "merfolk"
      ],
      "notes": "Nerida is now magically bound to the merfolk as a captain of their deep-navy. She maintains contact with her old crew through coral messages left each new moon. Her transformation and the nature of her ongoing service remain significant unresolved threads.",
      "first_story": "The Sea-Debt",
      "first_date": "2026-03-01",
      "appearances": 1
    },
    {
      "id": "merfolk",
      "name": "merfolk",
      "aliases": [],
      "tagline": "Sleek. Terrible. Magical.",
      "role": "Aquatic People; Sentient",
      "world": "known_world",
      "status": "active",
      "home_place": "Sunken Caverns",
      "home_region": "unknown",
      "home_realm": "unknown",
      "travel_scope": "regional",
      "bio": "Sentient aquatic beings who dwell in cities of coral and shell beneath the sea. The merfolk maintain vaults, command deep-navies, and enforce magical debts through summoned storms. They offered Nerida a bargain: her crew's service for a season or her own life, slowly drowned. Instead, Nerida dove and was transformed into a merfolk form, becoming a captain in their deep-navy.",
      "traits": [
        "magical",
        "ancient",
        "just",
        "formidable"
      ],
      "known_locations": [
        "Sunken Caverns",
        "deep-sea cities"
      ],
      "affiliations": [
        "Lamia",
        "Nerida"
      ],
      "notes": "Merfolk culture, governance, and full capabilities remain largely mysterious. Their transformation magic and ability to summon storms suggest advanced magical knowledge.",
      "first_story": "The Sea-Debt",
      "first_date": "2026-03-01",
      "appearances": 1
    },
    {
      "id": "lord_caevan",
      "name": "Lord Caevan",
      "aliases": [
        "Caevan"
      ],
      "tagline": "Changeling. Betrayer. Redeemed.",
      "role": "Advisor, Court Strategist",
      "world": "known_world",
      "status": "active",
      "home_place": "Queen's Court",
      "home_region": "unknown",
      "home_realm": "unknown",
      "travel_scope": "realmwide",
      "bio": "A fae-born changeling sworn to the Seelie Court, Caevan served as the Queen's closest advisor for fifteen years while sabotaging her kingdom from within. When the Rot-King's forces threatened the realm, magical chains compelled him to counsel surrender, but he broke free by biting his own tongue nearly in half. He confessed his true nature and betrayal to the Queen, and was offered redemption through honest service.",
      "traits": [
        "fae-born",
        "changeling",
        "conflicted",
        "strategist",
        "redeemed"
      ],
      "known_locations": [
        "Queen's private chambers"
      ],
      "affiliations": [
        "Seelie Court (former)",
        "The Queen (current)"
      ],
      "notes": "His redemption arc hinges on breaking fae-compulsion through physical pain; he now wages war against the Rot-King's forces.",
      "first_story": "The Courtier's Secret",
      "first_date": "2026-03-01",
      "appearances": 1
    },
    {
      "id": "the_queen",
      "name": "The Queen",
      "aliases": [],
      "tagline": "Merciful. Strategic. Betrayed.",
      "role": "Monarch, Ruler",
      "world": "known_world",
      "status": "active",
      "home_place": "Queen's Court",
      "home_region": "unknown",
      "home_realm": "unknown",
      "travel_scope": "realmwide",
      "bio": "An unnamed Queen who trusted Lord Caevan as her closest advisor for fifteen years, unaware of his fae-born nature and hidden allegiance to the Seelie Court. Upon his confession of betrayal, she chose mercy over execution, offering him redemption and enlisting him to help wage war against the Rot-King's forces.",
      "traits": [
        "merciful",
        "strategic",
        "perceptive",
        "regal"
      ],
      "known_locations": [
        "Queen's private chambers",
        "Queen's Court"
      ],
      "affiliations": [
        "Lord Caevan (advisor)",
        "Her kingdom"
      ],
      "notes": "Her choice to show mercy rather than execute a confessed traitor defines her character and sets the tone for the realm's response to the Rot-King threat.",
      "first_story": "The Courtier's Secret",
      "first_date": "2026-03-01",
      "appearances": 1
    },
    {
      "id": "bryn_the_dwarven_smith",
      "name": "Bryn the Dwarven Smith",
      "aliases": [
        "Bryn"
      ],
      "tagline": "Mastercrafter. Lonely. Loved.",
      "role": "Blacksmith, Weaponsmith",
      "world": "known_world",
      "status": "active",
      "home_place": "Her forge",
      "home_region": "unknown",
      "home_realm": "unknown",
      "travel_scope": "regional",
      "bio": "A Dwarven smith who had forged weapons for three kingdoms and sworn an oath to her craft, believing love would dull her focus. When Ashara the Archer arrived with a broken bow, Bryn deliberately delayed repairs to extend their time together, eventually admitting her deception and feelings.",
      "traits": [
        "dwarven",
        "mastercrafter",
        "sworn to craft",
        "lonely",
        "devoted"
      ],
      "known_locations": [
        "Her forge",
        "The mountains"
      ],
      "affiliations": [
        "Ashara the Archer"
      ],
      "notes": "She abandoned her forge and life's oath to leave with Ashara, choosing love over her sworn craft—a transformative break from her identity.",
      "first_story": "The Forge-Witch's Test",
      "first_date": "2026-03-01",
      "appearances": 1
    },
    {
      "id": "ashara_the_archer",
      "name": "Ashara the Archer",
      "aliases": [
        "Ashara"
      ],
      "tagline": "Grieving. Skilled. Chose love.",
      "role": "Archer, Warrior",
      "world": "known_world",
      "status": "active",
      "home_place": "unknown",
      "home_region": "unknown",
      "home_realm": "unknown",
      "travel_scope": "regional",
      "bio": "An archer who lost her partner in the Siege of Blackthorn and had sworn never to attach herself to another. She brought her broken bow to Bryn for repair and, over weeks of work, fell in love. She had deliberately re-damaged her bow to return to the forge, mirroring Bryn's deception.",
      "traits": [
        "archer",
        "grieving",
        "skilled",
        "lonely",
        "cautious"
      ],
      "known_locations": [
        "Bryn's forge",
        "Siege of Blackthorn",
        "The mountains"
      ],
      "affiliations": [
        "Bryn the Dwarven Smith"
      ],
      "notes": "She lost a partner at Blackthorn and had sworn against love until meeting Bryn; both characters' mutual deceptions were acts of hope.",
      "first_story": "The Forge-Witch's Test",
      "first_date": "2026-03-01",
      "appearances": 1
    },
    {
      "id": "mogrul",
      "name": "Mogrul",
      "aliases": [],
      "tagline": "Tyrant. Desperate. Changed.",
      "role": "Goblin-King, Ruler of the Warrens",
      "world": "known_world",
      "status": "active",
      "home_place": "Spire of Blackstone",
      "home_region": "unknown",
      "home_realm": "Goblin Warrens",
      "travel_scope": "regional",
      "bio": "The iron-fisted ruler of the goblin warrens beneath the Spire of Blackstone, who had conquered underground kingdoms through war and enslaved whole clans. When the Rot-King's plague devastated his people, he sought aid from Aeleth the Veilwright and agreed to transform his empire into a fellowship of free peoples.",
      "traits": [
        "goblin",
        "tyrant",
        "cunning",
        "desperate",
        "transformed"
      ],
      "known_locations": [
        "Spire of Blackstone",
        "Goblin Warrens"
      ],
      "affiliations": [
        "Aeleth the Veilwright (ally)",
        "Goblin nations (current fellowship)"
      ],
      "notes": "His transformation from absolute tyrant to shared-throne confederate ruler shows how crisis can reshape governance; he kept his throne but now shares power.",
      "first_story": "The Goblin-King's Mercy",
      "first_date": "2026-03-01",
      "appearances": 1
    },
    {
      "id": "aeleth_the_veilwright",
      "name": "Aeleth the Veilwright",
      "aliases": [],
      "tagline": "Wise. Hermit. Healer.",
      "role": "Wise-woman, Healer, Shaman",
      "world": "known_world",
      "status": "active",
      "home_place": "The deepest warren sanctuary",
      "home_region": "Grey Reaches",
      "home_realm": "unknown",
      "travel_scope": "regional",
      "bio": "A hermit wise-woman dwelling in the Grey Reaches who possessed knowledge of the old songs that could turn back plague-rot. She agreed to teach Mogrul's shamans in exchange for his kingdom becoming a free confederation, and later built a sanctuary in the deepest warren where goblin and human healers work together.",
      "traits": [
        "wise",
        "hermit",
        "healer",
        "compassionate",
        "powerful"
      ],
      "known_locations": [
        "Grey Reaches",
        "Goblin Warrens",
        "Deepest warren sanctuary"
      ],
      "affiliations": [
        "Mogrul (ally)",
        "Goblin and human healers"
      ],
      "notes": "She never returned to the Grey Reaches, instead choosing to build her sanctuary in the warrens; her knowledge of the old songs is central to curing plague-rot.",
      "first_story": "The Goblin-King's Mercy",
      "first_date": "2026-03-01",
      "appearances": 1
    },
    {
      "id": "zareth_astronomer_prince",
      "name": "Zareth the Astronomer-Prince",
      "aliases": [
        "Zareth"
      ],
      "tagline": "Star-reader. Oath-sworn. Sacrifice.",
      "role": "Astronomer-Prince, Ritualist",
      "world": "known_world",
      "status": "alive but memory-stripped",
      "home_place": "unknown",
      "home_region": "unknown",
      "home_realm": "unknown",
      "travel_scope": "interrealm",
      "bio": "Zareth spent his life reading the stars until the Violet Conjunction revealed to him that all stars were dying. He swore an oath to find and master the Stellar Rite, spending seven years traveling the known world learning from elders, druids, bone-carvers, and fae-touched hermits. On the night of the next Conjunction, he performed the Rite, sacrificing every joyful memory to birth new stars and save the world.",
      "traits": [
        "scholarly",
        "determined",
        "self-sacrificing",
        "star-touched"
      ],
      "known_locations": [
        "Singing Catacombs",
        "mountain"
      ],
      "affiliations": [
        "druids",
        "bone-carvers",
        "fae-touched hermits"
      ],
      "notes": "Zareth completed the Stellar Rite but lost all memory of joy, love, and beauty in the process. The consequences of his sacrifice and whether he survives remain unclear.",
      "first_story": "The Starfall Oath",
      "first_date": "2026-03-01",
      "appearances": 1
    }
  ],
  "places": [
    {
      "id": "temple_of_khar_zul",
      "name": "Temple of Khar-Zul",
      "world": "known_world",
      "description": "An inner-dark temple housing the idol of Khar-Zul, a god with nine emerald eyes worth more than most kingdoms. The shadows within are alive — by the third stolen gem they move; by the sixth they have teeth. The temple itself screamed in a voice of grinding granite when the god was robbed.",
      "status": "active — and aware",
      "notes": "Six of the nine emerald eyes are now loose in the world, carried by Vraxen. Three remain in the idol.",
      "hemisphere": "unknown",
      "continent": "unknown",
      "subcontinent": "unknown",
      "realm": "unknown",
      "province": "unknown",
      "region": "unknown",
      "district": "unknown",
      "place": "",
      "parent_place": "",
      "place_type": "temple"
    },
    {
      "id": "ashen_wastes",
      "name": "Ashen Wastes",
      "world": "known_world",
      "description": "A blasted wasteland crossed by spice caravans. Controlled by bandits, toll-lords, and worse. Blood-sorcerers operate here. The terrain is hostile enough that crossing it requires hired swords.",
      "status": "active",
      "notes": "The site of the blood-cursed caravan massacre. A shadow was stolen here.",
      "hemisphere": "unknown",
      "continent": "unknown",
      "subcontinent": "unknown",
      "realm": "unknown",
      "province": "unknown",
      "region": "unknown",
      "district": "unknown",
      "place": "",
      "parent_place": "",
      "place_type": ""
    },
    {
      "id": "pelimor",
      "name": "Pelimor",
      "world": "known_world",
      "description": "A city with functioning night markets where unusual commodities — including stolen shadows — are bought and sold by buyers who never give their names.",
      "status": "active",
      "notes": "Hub of shadow trade and other occult commerce. Aldric's stolen shadow was sold here.",
      "hemisphere": "unknown",
      "continent": "unknown",
      "subcontinent": "unknown",
      "realm": "unknown",
      "province": "unknown",
      "region": "unknown",
      "district": "unknown",
      "place": "",
      "parent_place": "",
      "place_type": "market",
      "appearances": 3
    },
    {
      "id": "sunken_ziggurat_of_yeng",
      "name": "Sunken Ziggurat of Yeng",
      "world": "known_world",
      "description": "An ancient subterranean ruin where the air tastes of centuries. Houses the Lamp of Suroth in a sealed chamber. Multiple sealed doors hint at further depths and further lamps — or worse.",
      "status": "partially explored",
      "notes": "Malachite Doss found and used the Lamp. The other sealed doors remain unexplored.",
      "hemisphere": "unknown",
      "continent": "unknown",
      "subcontinent": "unknown",
      "realm": "unknown",
      "province": "unknown",
      "region": "unknown",
      "district": "unknown",
      "place": "",
      "parent_place": "",
      "place_type": ""
    },
    {
      "id": "bone_citadel",
      "name": "The Bone Citadel",
      "world": "known_world",
      "description": "A living fortress of bone-white stone on the steppe. Towers breathe. Gates digest. The heart is a pulsing white chamber fed by roots spreading under the whole steppe. It absorbed 100 Veth warriors into its walls — alive, preserved, visible beneath the surface like insects in amber. Screamed for three days after Kael's assault, then went silent.",
      "status": "unknown — silent after the assault",
      "notes": "700 Veth warriors are dead. 100 are alive-in-walls. Kael Bloodhorn spent his life here. The Citadel's silence may mean death, dormancy, or something worse.",
      "hemisphere": "unknown",
      "continent": "unknown",
      "subcontinent": "unknown",
      "realm": "unknown",
      "province": "unknown",
      "region": "unknown",
      "district": "unknown",
      "place": "",
      "parent_place": "",
      "place_type": "fortress"
    },
    {
      "id": "amrath",
      "name": "Amrath",
      "world": "known_world",
      "description": "A city that survived a siege — the Siege of Amrath — during which Conjuress Mel made her desperate three-favor pact with Varek. Its current condition after the siege is unspecified.",
      "status": "post-siege",
      "notes": "The site of Mel's original demon pact. The political fallout of the siege is a potential story hook.",
      "hemisphere": "unknown",
      "continent": "unknown",
      "subcontinent": "unknown",
      "realm": "unknown",
      "province": "unknown",
      "region": "unknown",
      "district": "unknown",
      "place": "",
      "parent_place": "",
      "place_type": ""
    },
    {
      "id": "crimson_gate",
      "name": "Crimson Gate",
      "world": "known_world",
      "description": "A city burned with three thousand people inside by a man whose identity Cassia Vorn traded her certainty to learn. Now ruins.",
      "status": "ruins",
      "notes": "The arsonist has been identified by Cassia. His fate is a story hook. The ruins may hold survivors, ghosts, or artifacts.",
      "hemisphere": "unknown",
      "continent": "unknown",
      "subcontinent": "unknown",
      "realm": "unknown",
      "province": "unknown",
      "region": "unknown",
      "district": "unknown",
      "place": "",
      "parent_place": "",
      "place_type": "ruins"
    },
    {
      "id": "ostern",
      "name": "Ostern",
      "world": "known_world",
      "description": "A kingdom ruled by King Aldous III until his death. Home to the sealed vault beneath the city that housed the Plague-Bringer's Crown. After Aldous's death, the Crown was returned and a deeper vault was built.",
      "status": "active — under new rule",
      "notes": "The deeper vault is a story hook. Aldous's court may have retained his erratic advisors or courtiers who grew used to a backwards-shadowed king.",
      "hemisphere": "unknown",
      "continent": "unknown",
      "subcontinent": "unknown",
      "realm": "unknown",
      "province": "unknown",
      "region": "unknown",
      "district": "unknown",
      "place": "",
      "parent_place": "",
      "place_type": ""
    },
    {
      "id": "xul_thyris",
      "name": "Xul'thyris",
      "tagline": "",
      "place_type": "unknown",
      "world": "known_world",
      "hemisphere": "unknown",
      "continent": "unknown",
      "subcontinent": "unknown",
      "realm": "unknown",
      "province": "unknown",
      "region": "unknown",
      "district": "unknown",
      "atmosphere": "",
      "description": "Auto-added from character home_place.",
      "status": "unknown",
      "notes": "",
      "first_date": "2026-02-28",
      "appearances": 1
    },
    {
      "id": "tomb_of_shard_v_l",
      "name": "Tomb of Shard-Vêl",
      "tagline": "",
      "place_type": "unknown",
      "world": "known_world",
      "hemisphere": "unknown",
      "continent": "unknown",
      "subcontinent": "unknown",
      "realm": "unknown",
      "province": "unknown",
      "region": "unknown",
      "district": "unknown",
      "atmosphere": "",
      "description": "Auto-added from character home_place.",
      "status": "unknown",
      "notes": "",
      "first_date": "2026-02-28",
      "appearances": 1
    },
    {
      "id": "convent",
      "name": "convent",
      "tagline": "",
      "place_type": "unknown",
      "world": "known_world",
      "hemisphere": "unknown",
      "continent": "unknown",
      "subcontinent": "unknown",
      "realm": "unknown",
      "province": "unknown",
      "region": "unknown",
      "district": "unknown",
      "atmosphere": "",
      "description": "Auto-added from character home_place.",
      "status": "unknown",
      "notes": "",
      "first_date": "2026-02-28",
      "appearances": 1
    },
    {
      "id": "sunken_marches",
      "name": "Sunken Marches",
      "tagline": "",
      "place_type": "unknown",
      "world": "known_world",
      "hemisphere": "unknown",
      "continent": "unknown",
      "subcontinent": "unknown",
      "realm": "unknown",
      "province": "unknown",
      "region": "Sunken Marches",
      "district": "unknown",
      "atmosphere": "",
      "description": "Auto-added from character home_place.",
      "status": "unknown",
      "notes": "",
      "first_date": "2026-02-28",
      "appearances": 1
    },
    {
      "id": "tower",
      "name": "tower",
      "tagline": "",
      "place_type": "unknown",
      "world": "known_world",
      "hemisphere": "unknown",
      "continent": "unknown",
      "subcontinent": "unknown",
      "realm": "unknown",
      "province": "unknown",
      "region": "unknown",
      "district": "unknown",
      "atmosphere": "",
      "description": "Auto-added from character home_place.",
      "status": "unknown",
      "notes": "",
      "first_date": "2026-02-28",
      "appearances": 1
    },
    {
      "id": "grimmholt",
      "name": "Grimmholt",
      "tagline": "",
      "place_type": "unknown",
      "world": "known_world",
      "hemisphere": "unknown",
      "continent": "unknown",
      "subcontinent": "unknown",
      "realm": "unknown",
      "province": "unknown",
      "region": "unknown",
      "district": "unknown",
      "atmosphere": "",
      "description": "Auto-added from character home_place.",
      "status": "unknown",
      "notes": "",
      "first_date": "2026-02-28",
      "appearances": 1
    },
    {
      "id": "the_ossuary",
      "name": "the Ossuary",
      "tagline": "Living. Hungry. Consuming.",
      "place_type": "fortress",
      "world": "known_world",
      "hemisphere": "unknown",
      "continent": "unknown",
      "subcontinent": "unknown",
      "realm": "unknown",
      "province": "unknown",
      "region": "unknown",
      "district": "unknown",
      "atmosphere": "A fortress that breathes and hungers, its architecture alive and capable of conscious choice.",
      "description": "An impossible fortress whose walls are made of living calcium that split and swallow warriors whole. Its towers bend like intestines in peristaltic waves. The corridors rearrange themselves around intruders. It possesses agency and deliberately chose Varak Ironhelm as a vessel. Upon sating itself, it settles into patient stillness.",
      "status": "active",
      "notes": "Appears to be a sentient entity that feeds on those who breach it. Its true nature—whether construct, monster, or something else—remains unclear. It may have other names or ancient origins.",
      "first_date": "2026-02-28",
      "appearances": 1
    },
    {
      "id": "merchants_house",
      "name": "merchant's house",
      "tagline": "Bargain. Shadow. Ritual.",
      "place_type": "dwelling",
      "world": "known_world",
      "hemisphere": "unknown",
      "continent": "unknown",
      "subcontinent": "unknown",
      "realm": "unknown",
      "province": "unknown",
      "region": "unknown",
      "district": "unknown",
      "atmosphere": "A site of demonic contract and magical counter-ritual, where fate turns in a single night.",
      "description": "The house where Torvin made his demonic bargain with Varek and where Kira performed her counter-ritual to reverse the theft of his years. The ritual burned through the night.",
      "status": "active",
      "notes": "Significant as a battleground of magical wills between a demon and a sorceress. Torvin's daughter was healed here.",
      "first_date": "2026-02-28",
      "appearances": 1
    },
    {
      "id": "wasteland",
      "name": "Wasteland",
      "tagline": "Desolate. Empty. Unknown.",
      "place_type": "wilderness",
      "world": "known_world",
      "hemisphere": "unknown",
      "continent": "unknown",
      "subcontinent": "unknown",
      "realm": "unknown",
      "province": "unknown",
      "region": "unknown",
      "district": "unknown",
      "atmosphere": "A desolate, empty expanse where Naresh walks as a hollow shell.",
      "description": "An unmapped wasteland into which Naresh walked after sacrificing her humanity. Whether she walks still or has a destination is unknown.",
      "status": "active",
      "notes": "Possible location of Naresh's current activity or final resting place. May be the same as or adjacent to the Ashen Wastes from existing canon.",
      "first_date": "2026-02-28",
      "appearances": 1
    },
    {
      "id": "crimson_vale",
      "name": "Crimson Vale",
      "tagline": "Warlord-ruled. Corrupted. Cursed.",
      "place_type": "region",
      "world": "known_world",
      "hemisphere": "unknown",
      "continent": "unknown",
      "subcontinent": "unknown",
      "realm": "unknown",
      "province": "unknown",
      "region": "Crimson Vale",
      "district": "unknown",
      "atmosphere": "A region of ambition and prosperity turned to despair by supernatural debt collection.",
      "description": "A territory that Soroth established as warlord after finding Malachar's gold. For three months it flourished under his rule with hired soldiers and horses, then the collectors arrived. Now it is the domain of a cursed warlord-collector.",
      "status": "cursed",
      "notes": "Soroth still rules here but is enslaved to Malachar's collectors. Other inhabitants may be aware of the curse or may be victims of Soroth's new collecting activities.",
      "first_date": "2026-02-28",
      "appearances": 1
    },
    {
      "id": "tomb_malachar_gold",
      "name": "Tomb",
      "tagline": "Ancient. Gold-laden. Cursed.",
      "place_type": "ruin",
      "world": "known_world",
      "hemisphere": "unknown",
      "continent": "unknown",
      "subcontinent": "unknown",
      "realm": "unknown",
      "province": "unknown",
      "region": "unknown",
      "district": "unknown",
      "atmosphere": "A burial place containing wealth and supernatural obligation.",
      "description": "An ancient tomb where Soroth discovered three hundred pieces of Malachar's gold stamped with a skeletal crown. The tomb's location and other contents are unspecified.",
      "status": "active",
      "notes": "The tomb may contain more of Malachar's gold or other artifacts. Whether it is guarded or already looted is unclear. Malachar himself may have been interred here or elsewhere.",
      "first_date": "2026-02-28",
      "appearances": 1
    },
    {
      "id": "crystal_halls",
      "name": "crystal halls",
      "tagline": "Subterranean. Wondrous. Dragon-ruled.",
      "place_type": "palace / underground complex",
      "world": "known_world",
      "hemisphere": "unknown",
      "continent": "unknown",
      "subcontinent": "unknown",
      "realm": "unknown",
      "province": "unknown",
      "region": "unknown",
      "district": "unknown",
      "atmosphere": "A wondrous realm of crystalline beauty hidden beneath the world, ruled by dragons and their chosen consorts.",
      "description": "The crystal halls lie beneath the world and serve as the seat of Skyrakis the Wound-Wing and her dynasty. Prince Aldren now dwells here as the consort of Skyrakis's daughter, ruling at her side and fathering wyvern-blooded heirs.",
      "status": "active",
      "notes": "A new world opened to Aldren when he descended into the crystal halls. This may represent a hidden realm or underworld region.",
      "first_date": "2026-02-28",
      "appearances": 1
    },
    {
      "id": "wastelands",
      "name": "wastelands",
      "tagline": "Barren. Remote. Hermitic.",
      "place_type": "wilderness",
      "world": "known_world",
      "hemisphere": "unknown",
      "continent": "unknown",
      "subcontinent": "unknown",
      "realm": "unknown",
      "province": "unknown",
      "region": "unknown",
      "district": "unknown",
      "atmosphere": "A desolate, remote expanse where wise hermits dwell far from the reach of kings and courts.",
      "description": "The wastelands are a harsh, empty region where the cursewright's heir dwells as a hermit, removed from civilization. King Tormund traveled here seeking redemption.",
      "status": "active",
      "notes": "A refuge for those seeking solitude and wisdom, far from kingdoms and courts.",
      "first_date": "2026-02-28",
      "appearances": 1
    },
    {
      "id": "throne_room",
      "name": "throne room",
      "tagline": "Regal. Hollow. Cursed.",
      "place_type": "palace / seat of power",
      "world": "known_world",
      "hemisphere": "unknown",
      "continent": "unknown",
      "subcontinent": "unknown",
      "realm": "unknown",
      "province": "unknown",
      "region": "unknown",
      "district": "unknown",
      "atmosphere": "The seat of King Tormund's power, where he moved like a ghost bound to flesh, unable to taste poison, laugh at jests, or remember his own children.",
      "description": "King Tormund's throne room was the place where he conducted his cursed reign, slowly hollowed by oath-breaking. Ministers joked and served him wine, unaware of the curse that had stripped his senses.",
      "status": "active",
      "notes": "A place of governance corrupted by curse and broken oaths.",
      "first_date": "2026-02-28",
      "appearances": 1
    },
    {
      "id": "aethermarch",
      "name": "Aethermarch",
      "tagline": "Dreaming. Ancient. Consuming.",
      "place_type": "ruin",
      "world": "known_world",
      "hemisphere": "unknown",
      "continent": "unknown",
      "subcontinent": "unknown",
      "realm": "unknown",
      "province": "unknown",
      "region": "unknown",
      "district": "unknown",
      "atmosphere": "A city trapped between life and death, suffused with the echoing thoughts and emotions of ten thousand years of inhabitants.",
      "description": "The ruins of Aethermarch retain the memories of their inhabitants within stone and architecture. Libraries hold ghost-echoes of scholars' debates; temples thrummed with prayers of forgotten worshippers. Walking through the plaza allows one to feel the footsteps of merchants, children, and lovers across millennia. The city itself is sentient in some manner, dreaming and calling out to those who touch its memory-stones.",
      "status": "ruins",
      "notes": "Aethermarch appears to be a sentient or semi-sentient ruin capable of rewriting the minds of those who linger too long within it. The city's memories are intoxicating and dangerous—it seeks to preserve itself by absorbing and merging with human consciousnesses. It is unclear whether Aethermarch is truly alive or merely an echo-phenomenon of its dead civilization.",
      "first_date": "2026-02-28",
      "appearances": 1
    },
    {
      "id": "singing_catacombs",
      "name": "Singing Catacombs",
      "tagline": "Ancient. Resonant. Inscribed.",
      "place_type": "catacomb / ruin",
      "world": "known_world",
      "hemisphere": "unknown",
      "continent": "unknown",
      "subcontinent": "unknown",
      "realm": "unknown",
      "province": "unknown",
      "region": "unknown",
      "district": "unknown",
      "atmosphere": "A vast underground chamber filled with echoing sound and walls covered in prediluvian script.",
      "description": "The Singing Catacombs contain a cave wall inscribed in languages predating humanity itself. Within these inscriptions lies the knowledge of the Stellar Rite, which Zareth discovered and copied during his seven-year quest.",
      "status": "active",
      "notes": "The catacombs are a source of ancient magical knowledge; their location relative to other known world geography is unstated.",
      "first_date": "2026-03-01",
      "appearances": 1
    },
    {
      "id": "mountain_conjunction",
      "name": "Mountain",
      "tagline": "High. Star-touched. Ritual-site.",
      "place_type": "mountain",
      "world": "known_world",
      "hemisphere": "unknown",
      "continent": "unknown",
      "subcontinent": "unknown",
      "realm": "unknown",
      "province": "unknown",
      "region": "unknown",
      "district": "unknown",
      "atmosphere": "A high elevation beneath the stars, where the sky blazes with cosmic power.",
      "description": "A mountain where Zareth climbed to perform the Stellar Rite on the night of the Violet Conjunction, ultimately birthing new stars and sacrificing his memories.",
      "status": "active",
      "notes": "This mountain is significant as the epicenter of the Stellar Rite working.",
      "first_date": "2026-03-01",
      "appearances": 1
    },
    {
      "id": "drowned_hollows",
      "name": "Drowned Hollows",
      "tagline": "Silent. Plagued. Mourning.",
      "place_type": "village",
      "world": "known_world",
      "hemisphere": "unknown",
      "continent": "unknown",
      "subcontinent": "unknown",
      "realm": "unknown",
      "province": "unknown",
      "region": "unknown",
      "district": "unknown",
      "atmosphere": "A community devastated by plague, saved at great cost through an ancient bargain.",
      "description": "A village where the Rot-King's plague spread, blackening its people with septic rot. It was saved when Kess of the Drowned Hollows bargained with a wolf-spirit in the deep forest, lifting the plague by dawn but at the cost of her voice.",
      "status": "active",
      "notes": "The survivors of the plague live here. Kess returned silent to teach them the old songs through gesture.",
      "first_date": "2026-03-01",
      "appearances": 1
    },
    {
      "id": "deep_forest",
      "name": "deep forest",
      "tagline": "Ancient. Sacred. Wild.",
      "place_type": "wilderness",
      "world": "known_world",
      "hemisphere": "unknown",
      "continent": "unknown",
      "subcontinent": "unknown",
      "realm": "unknown",
      "province": "unknown",
      "region": "unknown",
      "district": "unknown",
      "atmosphere": "A primal wilderness where ancient magic dwells and beast-spirits emerge from shadow.",
      "description": "A deep forest where beast-spirits dwell and languages predating kingdoms are sung. It is the home of the wolf-spirit that Kess bargained with—a creature antlered and terrible, the size of a war-horse.",
      "status": "active",
      "notes": "Contains old magic and spirits. The tongue sung here predates kingdoms.",
      "first_date": "2026-03-01",
      "appearances": 1
    }
  ],
  "deities_and_entities": [
    {
      "id": "khar_zul",
      "name": "Khar-Zul",
      "type": "deity",
      "world": "known_world",
      "description": "A god worshipped in inner-dark temples, represented by an idol with nine emerald eyes. The idol's gems are warm to the touch. Khar-Zul's shadows have teeth. The temple screams in grinding granite when the god is robbed.",
      "status": "active — and offended",
      "notes": "Six of nine emerald eyes are missing. Khar-Zul's response to the theft is ongoing — the doppelganger shadow following Vraxen may be the god's instrument.",
      "hemisphere": "unknown",
      "continent": "unknown",
      "subcontinent": "unknown",
      "realm": "unknown",
      "province": "unknown",
      "region": "unknown",
      "district": "unknown",
      "place": "",
      "parent_place": ""
    },
    {
      "id": "yarithax",
      "name": "Yarithax",
      "type": "Lich-King (undead entity)",
      "world": "known_world",
      "description": "A dead Lich-King whose gold coins bear his profile and the inscription 'This debt is not yet settled.' The debt compounds daily. His collectors — two thin men in grey carrying ledgers, who walk through walls and never sleep — pursue all holders of his gold. Souls are worth less than twelve gold marks.",
      "status": "undead — collecting",
      "notes": "His gold still circulates. Tessaly Dorn has paid her debt but knows his collectors. More debtors exist.",
      "hemisphere": "unknown",
      "continent": "unknown",
      "subcontinent": "unknown",
      "realm": "unknown",
      "province": "unknown",
      "region": "unknown",
      "district": "unknown",
      "place": "",
      "parent_place": ""
    },
    {
      "id": "varek_entity",
      "name": "Varek",
      "type": "demon",
      "world": "known_world",
      "description": "A demon who collects temporal bargains with elegant efficiency. He drains years directly from mortal flesh and grows impressed by Kira's mastery of his own methods.",
      "status": "active",
      "notes": "Forms a partnership with Kira after she demonstrates her ingenuity. His true nature and realm of origin remain unknown.",
      "first_date": "2026-02-28",
      "appearances": 1
    },
    {
      "id": "ossuary_entity",
      "name": "the Ossuary",
      "type": "fortress-entity / unknown",
      "world": "known_world",
      "description": "A sentient fortress with walls of living calcium, towers that move like intestines, and corridors that rearrange themselves. It breathes, hungers, and makes conscious choices about whom to possess. It sated itself on seven hundred warriors and chose Varak Ironhelm as a vessel.",
      "status": "active",
      "notes": "Possibly a construct, a monster, or something older and stranger. It settles into patient stillness after feeding. Its intelligence and agency are undeniable.",
      "first_date": "2026-02-28",
      "appearances": 1
    },
    {
      "id": "malachar",
      "name": "Malachar",
      "type": "lich-king / undead / necromancer",
      "world": "known_world",
      "description": "A dead entity of considerable power whose name and will persist through supernatural collectors. Malachar's gold carries debts that compound in blood, loyalty, and life-years. The collectors act as autonomous agents enforcing these eternal debts.",
      "status": "dead",
      "notes": "Malachar is either a true lich with persistent consciousness or a bound curse that perpetuates after death. The extent of Malachar's original power and the source of the collectors' authority are unexplained.",
      "first_date": "2026-02-28",
      "appearances": 1
    },
    {
      "id": "skyrakis_the_wound_wing_entity",
      "name": "Skyrakis the Wound-Wing",
      "type": "dragon",
      "world": "known_world",
      "description": "A great dragon with amber eyes, ancient and patient. She is bound by oaths sworn generations ago and respects negotiation and honor. She rules the crystal halls beneath the world and has a daughter coming of age.",
      "status": "active",
      "notes": "She is capable of threatening kingdoms with fire and honors those who negotiate with courage.",
      "first_date": "2026-02-28",
      "appearances": 1
    },
    {
      "id": "wolf_spirit_drowned_hollows",
      "name": "wolf-spirit",
      "type": "spirit / beast-spirit",
      "world": "known_world",
      "description": "A terrible antlered creature the size of a war-horse, dwelling in the deep forest where beast-spirits reside. It emerged from shadow to negotiate Kess's bargain, accepting her voice as payment to lift the plague.",
      "status": "active",
      "notes": "A being of the old world, responsive to songs in the ancient tongue. Its bargain was honored—the plague lifted by dawn. Its form is neither fully wolf nor fully natural.",
      "first_date": "2026-03-01",
      "appearances": 1
    },
    {
      "id": "rot_king",
      "name": "Rot-King",
      "type": "entity / plague-bringer",
      "world": "known_world",
      "description": "An entity or force that spreads plague, including the septic rot that blackened the Drowned Hollows. No physical form described, but its plague manifests as blackening septic rot in victims.",
      "status": "active",
      "notes": "Plague lifted by Kess's bargain; status after unknown. May be a person, a spirit, or a force.",
      "first_date": "2026-03-01",
      "appearances": 1
    },
    {
      "id": "the_crown",
      "name": "the Crown",
      "type": "polity / institution",
      "world": "known_world",
      "description": "A governing authority that sent a priest to the Drowned Hollows offering divine mercy to the plague-stricken. Kess refused its aid.",
      "status": "active",
      "notes": "Represents institutional divine/temporal authority. Kess's refusal of its mercy suggests she valued the old ways over modern governance.",
      "first_date": "2026-03-01",
      "appearances": 1
    }
  ],
  "artifacts": [
    {
      "id": "lamp_of_suroth",
      "name": "Lamp of Suroth",
      "world": "known_world",
      "location": "Sunken Ziggurat of Yeng",
      "description": "An iron lamp, ugly, filled with something that is not oil. Its inscription: 'He who lights this buys one truth at the cost of one lie he has lived by.' The flame burns black. The truth that emerges is always smaller than the lie it consumes. The lamp gutters out after one use per visitor.",
      "status": "used once — may be refillable",
      "notes": "Malachite Doss used it. Other sealed doors in the Ziggurat may house similar or worse artifacts.",
      "hemisphere": "unknown",
      "continent": "unknown",
      "subcontinent": "unknown",
      "realm": "unknown",
      "province": "unknown",
      "region": "unknown",
      "district": "unknown",
      "place": "",
      "parent_place": ""
    },
    {
      "id": "plague_bringers_crown",
      "name": "The Plague-Bringer's Crown",
      "world": "known_world",
      "location": "deeper vault beneath Ostern",
      "description": "A relic that killed four wearers before Aldous III survived thirty seconds. Wearing it projects absolute desperation — the aura of a man with nothing left to lose. Its curse runs deep; Aldous's shadow was on backwards for eleven years after wearing it for half a minute.",
      "status": "sealed in deeper vault",
      "notes": "Four previous wearers are dead. Aldous survived but was changed. The deeper vault at Ostern is a story hook.",
      "hemisphere": "unknown",
      "continent": "unknown",
      "subcontinent": "unknown",
      "realm": "unknown",
      "province": "unknown",
      "region": "unknown",
      "district": "unknown",
      "place": "",
      "parent_place": ""
    },
    {
      "id": "emerald_eyes_of_khar_zul",
      "name": "The Six Emerald Eyes of Khar-Zul",
      "world": "known_world",
      "location": "with Vraxen the Knife (last known)",
      "description": "Six of nine emerald eyes pried from the idol of Khar-Zul. Each was warm — obscenely so — to the touch. Worth more than most kingdoms. Three remain in the idol.",
      "status": "loose in the world",
      "notes": "Six gems in unknown hands. Each may carry a fragment of Khar-Zul's attention or malice.",
      "hemisphere": "unknown",
      "continent": "unknown",
      "subcontinent": "unknown",
      "realm": "unknown",
      "province": "unknown",
      "region": "unknown",
      "district": "unknown",
      "place": "",
      "parent_place": ""
    },
    {
      "id": "vex_stolen_shadows",
      "name": "stolen shadows",
      "tagline": "Illicit. Dangerous. Cursed.",
      "artifact_type": "shadow / magical goods",
      "origin": "Liberated by Vex from a dying sorcerer's vault.",
      "powers": "Unknown, but they are priceless and untraceable. They can be stored in clay jars. Some shadows are inhabited by malevolent entities and can be weaponized against their original owners.",
      "last_known_holder": "Sold by morning after Vex's capture, distributed to highest bidders.",
      "status": "lost / circulating",
      "notes": "Vex's entire stock was stolen shadows. One of them—his own—was worn by a malevolent entity and used as a trap. This suggests shadows have value beyond mere magic and can be cursed.",
      "first_date": "2026-02-28",
      "appearances": 1
    },
    {
      "id": "malachars_gold",
      "name": "Malachar's Gold",
      "tagline": "Cursed. Tempting. Eternal.",
      "artifact_type": "currency / relic",
      "origin": "Minted or created by Malachar, marked with a skeletal crown.",
      "powers": "Each coin carries a supernatural debt that compels the holder into service of Malachar's collectors. The debt compounds daily in blood, loyalty, and life-years extracted. Gold cannot pay the debt—only service can.",
      "last_known_holder": "Soroth",
      "status": "active",
      "notes": "Three hundred pieces were discovered in a tomb by Soroth. The coins are autonomous magical artifacts that enforce their own collection. Whether other pieces exist, where they are located, or who else has found them is unknown. The curse appears to activate after a delay (three months in Soroth's case).",
      "first_date": "2026-02-28",
      "appearances": 1
    }
  ],
  "hemispheres": [],
  "continents": [],
  "subcontinents": [],
  "realms": [],
  "provinces": [],
  "districts": [],
  "events": [
    {
      "id": "blue_eclipse",
      "name": "The Blue Eclipse",
      "tagline": "Celestial. Transformative. Singular.",
      "event_type": "celestial phenomenon",
      "scope": "world",
      "epicenter_place": "unknown",
      "epicenter_region": "unknown",
      "epicenter_realm": "unknown",
      "affected_places": [],
      "affected_regions": [],
      "affected_realms": [],
      "radius": "At least wide enough to reach Naresh's location",
      "participants": [
        "Naresh the Bone Carver"
      ],
      "outcome": "A night when moonlight was stained indigo, enabling Naresh to complete her ritual of creating a truly sentient skeleton.",
      "significance": "The blue eclipse appears to be a rare celestial event enabling major magical workings. It may recur or be tied to other significant events.",
      "notes": "The mechanics of why this eclipse enabled the ritual are unexplained. Whether it was unique or cyclical is unknown. Other mages or entities may have used or waited for this night.",
      "first_date": "2026-02-28",
      "appearances": 1
    },
    {
      "id": "the_dragon_s_bargain",
      "name": "the Dragon's Bargain",
      "tagline": "Negotiation. Sacrifice. Redemption.",
      "event_type": "ritual / diplomatic accord",
      "scope": "realmwide",
      "epicenter_place": "unknown",
      "epicenter_region": "unknown",
      "epicenter_realm": "unknown",
      "affected_places": [
        "crystal halls"
      ],
      "affected_regions": [],
      "affected_realms": [],
      "radius": "Unknown, but affects an entire kingdom and royal family.",
      "participants": [
        "Prince Aldren",
        "Skyrakis the Wound-Wing",
        "the merchant's daughter (bride-to-be)",
        "Aldren's father (oath-breaker)"
      ],
      "outcome": "Aldren accepted Skyrakis's bargain and wed the dragon's daughter in the crystal halls. He negotiated a counter-oath ensuring his future wyvern-blooded children could choose their own path. The kingdom was spared from dragon fire.",
      "significance": "This event resolved an ancient blood-marriage oath sworn by Aldren's grandmother to Skyrakis's grandmother, prevented the kingdom's destruction, and created a new dynasty of hybrid heirs with free will.",
      "notes": "The counter-oath Aldren swore is unprecedented: wyvern-blooded children will have the right to choose between dragon and human service. This breaks the cycle of forced oaths.",
      "first_date": "2026-02-28",
      "appearances": 1
    },
    {
      "id": "violet_conjunction",
      "name": "Violet Conjunction",
      "tagline": "Celestial. Prophetic. World-altering.",
      "event_type": "celestial event / prophecy",
      "scope": "world",
      "epicenter_place": "unknown",
      "epicenter_region": "unknown",
      "epicenter_realm": "unknown",
      "affected_places": [],
      "affected_regions": [],
      "affected_realms": [],
      "radius": "global; visible across the known world",
      "participants": [
        "Zareth the Astronomer-Prince",
        "the stars"
      ],
      "outcome": "The stars spoke to Zareth, revealing their imminent death. This triggered Zareth's oath to find and perform the Stellar Rite.",
      "significance": "The Violet Conjunction represents the moment of cosmic revelation that set the entire narrative in motion; without it, the world would eventually fall into endless night.",
      "notes": "The Conjunction recurs (at least once more during the story). Its exact periodicity is unknown.",
      "first_date": "2026-03-01",
      "appearances": 1
    },
    {
      "id": "starfall_oath",
      "name": "The Starfall Oath",
      "tagline": "Sworn. Cosmic. Unbreakable.",
      "event_type": "oath / ritual",
      "scope": "world",
      "epicenter_place": "unknown",
      "epicenter_region": "unknown",
      "epicenter_realm": "unknown",
      "affected_places": [],
      "affected_regions": [],
      "affected_realms": [],
      "radius": "global",
      "participants": [
        "Zareth the Astronomer-Prince"
      ],
      "outcome": "Zareth swore to find the Stellar Rite, master it, or die trying. He subsequently spent seven years seeking knowledge and ultimately performed the Rite successfully.",
      "significance": "This oath commits Zareth to the fate of all stars and the world itself, placing him at the center of cosmic salvation.",
      "notes": "The oath is sworn beneath the Violet Conjunction and is implicit in the story's title.",
      "first_date": "2026-03-01",
      "appearances": 1
    }
  ],
  "weapons": [],
  "factions": [],
  "lore": [
    {
      "id": "shadows_bite_back",
      "name": "Some Shadows Bite Back",
      "tagline": "Warning. Vendetta. Justice.",
      "category": "legend",
      "source": "Merchants in Pelimor's night markets whisper this warning after Vex's capture.",
      "status": "confirmed",
      "notes": "Merchants learned from Vex's fate that shadows are not inert goods; some are inhabited, some are cursed, and some circulate the markets with hidden agendas. This knowledge spreads as a cautionary tale.",
      "first_date": "2026-02-28",
      "appearances": 1
    },
    {
      "id": "shadows_retain_memory",
      "name": "Shadows Retain Memory",
      "tagline": "Haunting. Sentient. Irredeemable.",
      "category": "legend / lore",
      "source": "Discovered by Mira the Shadow-Dancer in Pelimor.",
      "status": "confirmed",
      "notes": "Shadows carry the memories and grief of their owners. When stolen and worn by another, they can manifest their own will and compulsion, seeking revenge or justice. A shadow's grief cannot be bought away—only destroyed at terrible cost.",
      "first_date": "2026-02-28",
      "appearances": 1
    },
    {
      "id": "memory_stones_phenomenon",
      "name": "Memory-Stones",
      "tagline": "Living. Recording. Dangerous.",
      "category": "history",
      "source": "Discovered by Lyssa in Aethermarch",
      "status": "confirmed",
      "notes": "The stones and walls of Aethermarch retain the memories of the civilization that built and inhabited the city. Touching these stones allows direct access to ghost-echoes of past inhabitants—their debates, prayers, emotions, and experiences. The knowledge is intoxicating but corrupting; prolonged contact causes the person to lose their own identity and be gradually replaced by the memories themselves.",
      "first_date": "2026-02-28",
      "appearances": 1
    },
    {
      "id": "old_magic",
      "name": "Old Magic",
      "tagline": "Prediluvian. Powerful. Forgotten.",
      "category": "history / magic",
      "source": "Ancient inscriptions in the Singing Catacombs and teachings from druids, bone-carvers, and fae-touched hermits",
      "status": "partially confirmed",
      "notes": "Old Magic predates gods and kingdoms. The Stellar Rite is an example of this primordial power.",
      "first_date": "2026-03-01",
      "appearances": 1
    },
    {
      "id": "tongue_predating_kingdoms",
      "name": "tongue that predated kingdoms",
      "tagline": "Primal. Ancient. Powerful.",
      "category": "legend / language",
      "source": "Beast-spirits and old places like the deep forest",
      "status": "confirmed",
      "notes": "Kess sang the names of the dead in this tongue to call the wolf-spirit. It holds power over nature and spirits.",
      "first_date": "2026-03-01",
      "appearances": 1
    },
    {
      "id": "old_songs_singers_dreams",
      "name": "singing only in dreams",
      "tagline": "Silent. Sacrifice. Spirit-Touched.",
      "category": "legend / magic",
      "source": "The wolf-spirit's bargain with Kess",
      "status": "confirmed",
      "notes": "Kess's voice was taken; she now sings the old songs only in dreams. Her throat is burned with ancient magic, rendering her permanently mute.",
      "first_date": "2026-03-01",
      "appearances": 1
    },
    {
      "id": "debts_paid_silence",
      "name": "some debts are paid in silence",
      "tagline": "Sacrifice. Sacred. Permanent.",
      "category": "legend / wisdom",
      "source": "The outcome of Kess's bargain",
      "status": "confirmed",
      "notes": "A philosophical reflection on Kess's choice. Suggests that some prices cannot be measured in gold or common currency.",
      "first_date": "2026-03-01",
      "appearances": 1
    }
  ],
  "flora_fauna": [
    {
      "id": "wyvern",
      "name": "wyvern",
      "tagline": "Hybrid. Dragon-blooded. Choice.",
      "type": "creature",
      "rarity": "rare",
      "habitat": "crystal halls",
      "status": "thriving",
      "notes": "The offspring of Prince Aldren and Skyrakis's daughter are described as 'wyvern-blooded heirs.' Aldren's counter-oath ensures these hybrid creatures will have the free choice to serve either their dragon heritage or their human kin.",
      "first_date": "2026-02-28",
      "appearances": 1
    },
    {
      "id": "wolf_spirit_beast",
      "name": "wolf-spirit",
      "tagline": "Antlered. Terrible. Ancient.",
      "type": "spirit / beast",
      "rarity": "legendary",
      "habitat": "deep forest",
      "status": "active",
      "notes": "A creature the size of a war-horse, antlered and terrible, dwelling in the deep forest. Emerged from shadow to bargain with Kess. A being of old magic, responsive to the ancient tongue.",
      "first_date": "2026-03-01",
      "appearances": 1
    }
  ],
  "magic": [
    {
      "id": "stellar_rite_magic",
      "name": "Stellar Rite",
      "tagline": "Star-birthing. Memory-consuming. World-saving.",
      "type": "ritual",
      "element": "stellar / cosmic",
      "difficulty": "forbidden",
      "status": "known",
      "notes": "A working of old magic that births new stars. Requires sacrifice of all joyful memories from the caster.",
      "first_date": "2026-03-01",
      "appearances": 1
    },
    {
      "id": "throat_burned_ancient_magic",
      "name": "throat burned with ancient magic",
      "tagline": "Silent. Permanent. Sacred.",
      "type": "passive / curse / transformation",
      "element": "old magic / void",
      "difficulty": "forbidden",
      "status": "known",
      "notes": "A magical mark placed on Kess's throat as payment for the wolf-spirit's bargain. Renders her permanently mute. She can no longer speak or sing aloud, only in dreams.",
      "first_date": "2026-03-01",
      "appearances": 1
    }
  ],
  "relics": [
    {
      "id": "malachars_gold_relic",
      "name": "Malachar's Gold",
      "tagline": "Skeletal-crowned. Cursed. Binding.",
      "origin": "Minted or enchanted by Malachar, a dead lich-king or necromancer.",
      "power": "Each coin carries an autonomous supernatural debt that compels the holder into eventual servitude to Malachar's collectors. The debt compounds in blood, loyalty, and life-years daily.",
      "curse": "Possession of even one coin triggers supernatural debt collection. The collectors will take soldiers sworn to the holder, then horses/resources, then extract life-years from the holder themselves. The only escape is to accept servitude as a collector enforcing the same debt on others. The debt is eternal and cannot be repaid in gold.",
      "status": "active",
      "notes": "Three hundred pieces were found by Soroth. The curse mechanism appears to have a delay before collectors manifest (three months in Soroth's case). The collectors operate autonomously but in service of Malachar's will. The coins are stamped with a skeletal crown.",
      "first_date": "2026-02-28",
      "appearances": 1
    },
    {
      "id": "merchant_s_shadow",
      "name": "merchant's shadow",
      "tagline": "Stolen. Haunted. Avenging.",
      "origin": "Stolen years before the story from an unnamed merchant in Pelimor.",
      "power": "Allows the wearer to move through daylight without shadow-betrayal. However, the shadow retains the memory and grief of its original owner.",
      "curse": "The shadow's retained memories and desire for revenge manifest involuntarily, forcing the wearer's body toward the shadow's enemies. It demands vengeance and cannot be controlled.",
      "status": "destroyed (burned by Mira)",
      "notes": "When Mira burned the shadow to escape its compulsion, she felt its death agony—a shared scream of incineration. The shadow's destruction was permanent and irreversible.",
      "first_date": "2026-02-28",
      "appearances": 1
    }
  ],
  "regions": [
    {
      "id": "the_blasted_steppes",
      "name": "the blasted steppes",
      "tagline": "",
      "continent": "unknown",
      "realm": "unknown",
      "climate": "unknown",
      "terrain": "unknown",
      "function": "Auto-added from character home_region.",
      "status": "unknown",
      "notes": "",
      "first_date": "2026-02-28",
      "appearances": 1,
      "world": "The Known World",
      "hemisphere": "unknown",
      "subcontinent": "unknown",
      "province": "unknown",
      "region": "the blasted steppes",
      "district": "unknown"
    },
    {
      "id": "sunken_marches",
      "name": "Sunken Marches",
      "tagline": "",
      "continent": "unknown",
      "realm": "unknown",
      "climate": "unknown",
      "terrain": "unknown",
      "function": "Auto-added from character home_region.",
      "status": "unknown",
      "notes": "",
      "first_date": "2026-02-28",
      "appearances": 1,
      "world": "The Known World",
      "hemisphere": "unknown",
      "subcontinent": "unknown",
      "province": "unknown",
      "region": "Sunken Marches",
      "district": "unknown"
    },
    {
      "id": "sapphire_deep",
      "name": "Sapphire Deep",
      "tagline": "",
      "continent": "unknown",
      "realm": "unknown",
      "climate": "unknown",
      "terrain": "unknown",
      "function": "Auto-added from character home_region.",
      "status": "unknown",
      "notes": "",
      "first_date": "2026-02-28",
      "appearances": 1,
      "world": "The Known World",
      "hemisphere": "unknown",
      "subcontinent": "unknown",
      "province": "unknown",
      "region": "Sapphire Deep",
      "district": "unknown"
    },
    {
      "id": "crimson_vale_region",
      "name": "Crimson Vale",
      "tagline": "Warlord-ruled. Prosperous. Cursed.",
      "continent": "unknown",
      "realm": "unknown",
      "climate": "unknown",
      "terrain": "unknown",
      "function": "A territory capable of supporting a warlord's personal dominion with hired soldiers and horses. Now serves as a locus for Malachar's curse collection.",
      "status": "cursed",
      "notes": "Established as Soroth's domain after he found Malachar's gold. Prospered for three months before collectors arrived. Now ruled by the cursed warlord Soroth who collects debts from others.",
      "first_date": "2026-02-28",
      "appearances": 1,
      "world": "The Known World",
      "hemisphere": "unknown",
      "subcontinent": "unknown",
      "province": "unknown",
      "region": "Crimson Vale",
      "district": "unknown"
    },
    {
      "id": "pelimor_region",
      "name": "Pelimor",
      "tagline": "Criminal. Shadowed. Mercantile.",
      "continent": "unknown",
      "realm": "unknown",
      "climate": "unknown",
      "terrain": "urban",
      "function": "A criminal underworld center and night market hub where stolen goods—including shadows—are bought, sold, and stored in vaults. A place where thieves of high caliber operate.",
      "status": "active",
      "notes": "Pelimor's night markets and vaults are integral to the shadow-theft economy. Mira operated here for years.",
      "first_date": "2026-02-28",
      "appearances": 1,
      "world": "The Known World",
      "hemisphere": "unknown",
      "subcontinent": "unknown",
      "province": "unknown",
      "region": "Pelimor",
      "district": "unknown"
    },
    {
      "id": "drowned_hollows_region",
      "name": "Drowned Hollows",
      "tagline": "Silent. Rural. Plagued.",
      "continent": "unknown",
      "realm": "unknown",
      "climate": "temperate",
      "terrain": "forest / village",
      "function": "A rural community rooted in the old ways and knowledge of ancient songs. Center of the Rot-King's plague.",
      "status": "active",
      "notes": "Home to Kess and survivors of the plague. The village still practices bone-singing and old magic traditions.",
      "first_date": "2026-03-01",
      "appearances": 1,
      "world": "The Known World",
      "hemisphere": "unknown",
      "subcontinent": "unknown",
      "province": "unknown",
      "region": "Drowned Hollows",
      "district": "unknown"
    }
  ],
  "substances": [
    {
      "id": "stolen_shadows",
      "name": "stolen shadows",
      "tagline": "Illicit. Priceless. Dangerous.",
      "type": "magical commodity / shadow",
      "rarity": "rare",
      "properties": "Unknown magical properties; untraced and untraceable; can be stored in clay jars; some are inhabited by malevolent entities.",
      "use": "Traded in night markets as high-value illicit goods. Can be weaponized against their original owners if inhabited by malevolent forces.",
      "notes": "Vex stole a fortune of these from a dying sorcerer's vault. They are valuable enough to attract multiple buyers in a single night. Some circulate the markets with hidden agendas.",
      "first_date": "2026-02-28",
      "appearances": 1
    },
    {
      "id": "malachars_gold_substance",
      "name": "Malachar's Gold",
      "tagline": "Cursed. Marked. Autonomous.",
      "type": "enchanted metal / currency",
      "rarity": "rare",
      "properties": "Stamped with a skeletal crown. Carries autonomous supernatural debt. Compels holder into servitude.",
      "use": "Intended as currency or treasure, but functions as a curse-delivery mechanism. Cannot be safely used as currency due to debt activation.",
      "notes": "The gold itself is real and valuable, but the curse outweighs its worth. The curse activates regardless of the holder's knowledge or intent.",
      "first_date": "2026-02-28",
      "appearances": 1
    },
    {
      "id": "septic_rot",
      "name": "septic rot",
      "tagline": "Blackening. Plague. Deadly.",
      "type": "plague / sickness",
      "rarity": "rare",
      "properties": "A manifestation of plague that blackens the skin of victims. Caused by the Rot-King. Spreads through a village rapidly.",
      "use": "A curse or plague weapon; not used intentionally by mortals.",
      "notes": "Lifted from the Drowned Hollows by Kess's bargain. The mechanism of transmission or cure is unknown.",
      "first_date": "2026-03-01",
      "appearances": 1
    }
  ],
  "rituals": [
    {
      "id": "oath_breaker_s_curse",
      "name": "Oath-Breaker's Curse",
      "tagline": "Punishment. Erosion. Teaching.",
      "ritual_type": "curse",
      "performed_by": [
        "the cursewright (original caster)"
      ],
      "requirements": "Unknown; cast in response to Tormund's repeated oath-breaking.",
      "effect": "Each oath Tormund breaks steals something irreplaceable: first taste, then laughter, then memory of his firstborn son. By the twentieth oath, he is hollow.",
      "cost": "The curse is irreversible and permanent. It cannot be lifted—only borne and transformed through new honor.",
      "notes": "The cursewright designed this curse to teach that oaths are bonds, not chains. It is elegant in its mechanism: loss is cumulative and specific to each oath.",
      "first_date": "2026-02-28",
      "appearances": 1
    },
    {
      "id": "stellar_rite",
      "name": "Stellar Rite",
      "tagline": "Star-birthing. Memory-sacrificial. Ancient.",
      "ritual_type": "sacrifice / binding / summoning",
      "performed_by": [
        "Zareth the Astronomer-Prince"
      ],
      "requirements": "Knowledge of ancient languages predating humanity; performance beneath the Violet Conjunction; a mountain or high location beneath the stars.",
      "effect": "Births new stars from the ashes of dying ones, preventing the world from falling into endless night and extending the world's lifespan by ten thousand years.",
      "cost": "The caster must sacrifice every moment of joy, every love, every triumph, and every small beauty—effectively stripping them of all positive memories.",
      "notes": "The Rite was discovered inscribed in the Singing Catacombs in languages predating humanity. Zareth learned it through seven years of study with druids, bone-carvers, and fae-touched hermits.",
      "first_date": "2026-03-01",
      "appearances": 1
    }
  ],
  "polities": [
    {
      "id": "the_crown",
      "name": "the Crown",
      "tagline": "Divine. Institutional. Merciful.",
      "polity_type": "monarchy / crown",
      "realm": "unknown",
      "region": "unknown",
      "seat": "unknown",
      "sovereigns": [],
      "claimants": [],
      "status": "active",
      "description": "A governing authority that offers divine mercy through priests. It extended mercy to the Drowned Hollows during the plague, but Kess refused its aid in favor of bargaining with ancient spirits.",
      "notes": "Represents institutional power separate from and opposed to old magic traditions.",
      "first_date": "2026-03-01",
      "appearances": 1
    }
  ]
}